# app/services/text_optimization.rb

module TextOptimization
  # require_relative '../services/dictionaries/replaсe_keyword_tyres' - не работает в винде
  # !!!! - константы просто перемещены в этот файл (проверено)
  # ========================================================
  # константы из /services/dictionaries/replaсe_keyword_tyres
  # ========================================================
  WORD_FORMS = {
    "шина" => ["шина", "шины", "шину", "шине", "шиною", "шинах", "шинами", "шинных", "шин "],
    "резина" => ["резина", "резины", "резину", "резине", "резиной", "резин", "резинами", "резинах"],
    "Киев" => ["Киев", "Киева", "Киеву", "Киеве"],
    "купить" => ["купить", "купил"],
    "размер" => ["размер", "размера", "размеру", "размере", "размером", "размеры", "размерами", "размерах"],
    "выбор" => ["выбор", "выбора", "выбору", "выборе", "выбором"],
    "покупка" => ["покупка", "покупки", "покупку", "покупке", "покупкой", "покупками", "покупках"],
    "заказ" => ["заказ", "заказа", "заказу", "заказе", "заказом", "заказы", "заказами", "заказах"],
    "цена" => ["цена", "цены", "цене", "цен", "ценами", "цены", "ценах", "ценам"],
    "купить шины" => ["купить шины", "купить шину"],
    "шины купить" => ["шины купить", "шину купить"],
    "купить резину" => ["купить резину"],
    "резину купить" => ["резину купить"],
    "заказать" => ["заказать", "заказал", "заказали", "заказав"],
    "лето" => ['лета', 'лето', 'лету', 'летом', 'лете'],
    "летние" => ['летние', 'летних', 'летним', 'летними', 'летней'],
    "зима" => ['зима', 'зимы', 'зиме', 'зиму', 'зимой'],
    "зимние" => ['зимние', 'зимних', 'зимним', 'зимними', 'зимней'],
    "всесезонние" => ['всесезонные', 'всесезонных', 'всесезонным', 'всесезонными']
  }

  KEYWORD_STUFFING_TEMPLATE = {
    "резина и шины" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.0,
      'replaces' => {
        /товар(а|ов)|продуктов/ => " резины и шин ",
        /ый товар/ => "ые резина и шины ",
        /ых товаров/ => "ых резины и шин ",
        /продукции/ => " резины и шин ",
        /товары|продукция/ => " резина и шины ",
        /птимальное решение для / => "птимальные резина и шины для ",
        /одбора оптимального варианта для/ => "одбора оптимального варианта резины и шин для ",
        /ый (выбор|вариант)(?=$|\.|\:|\sдля)/ => "ое решение для покупки резины и шин: ",
        /лучшие цены на рынке/ => "шины и резина по лучшей цене на рынке",
        /сделать покупку максимально/ => " сделать покупку резины и шины максимально ",
        /\sвыбор\s/ => " выбор, чтобы купить шины и резину, ",
        /помочь в выборе/ => "помочь купить шины и резину",
        /ри выборе шин/ => "ри покупке шин и резины",
      },
      'sinonims' => {}
    },
    "шина" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 4.0,
      'replaces' => {
        /товар(а|ов)|продуктов/ => "шин ",
        /ый товар(а|)/ => "ые шины ",
        /товары|продукци(я|ю)/ => "шины ",
        /птимальное решение для / => "птимальные шины для ",
        /одбора оптимального варианта для/ => "одбора оптимального варианта шин для ",
        /Соблюдение рекомендаций производителя -/ => "Соблюдение рекомендаций производителя относительно шин - ",
        /ый (выбор|вариант)(?=$|\.|\:|\sдля)/ => "ое решение для покупки шин ",
        /лучшие цены на рынке/ => "шины по лучшей цене на рынке ",
        /сделать покупку максимально/ => "сделать покупку шины максимально ",
        /помочь в выборе/ => "помочь купить шины ",
        /окупая новую резину/ => "окупая новые шины и резину",
        /риобретая новую резину/ => "риобретая новые шины и резину",
        /продукции/ => "шин",

      },
      'sinonims' => {
        /\bшины\b/ => ["колеса"],
        /\bшин\b/ => ["колес", "авторезины"],
        /\bшинам\b/ => ["колесам", "покрышкам", "авторезине"],
        /\bшинами\b/ => ["колесами", "авторезиной"],
        /\bшинах\b/ => ["колесах", "авторезине"]
      }
    },
    "резина" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 2.2,
      'replaces' => {
        /товар(а|ов)|продуктов/ => "резины ",
        /ого товара/ => "ой резины ",
        /товары|продукция/ => "резина ",
        /птимальное решение для / => "птимальная резина для ",
        /одбора оптимального варианта для/ => "одбора оптимального варианта резины для ",
        /лучшие цены на рынке/ => "резина по лучшей цене на рынке ",
        /сделать покупку максимально/ => "сделать покупку резины максимально ",
        /новых шин/ => "новых шин (новой резины)",
        /при выборе шин/ => "при подборе резины и шин",
        /окупая новые шины/ => "окупая новые шины и резину",
        /риобретая новые шины/ => "риобретая новые шины и резину",
        /продукции/ => "резины",
      },
      'sinonims' => {
        /\bрезина\b/ => ["колеса", "автошины", "авторезина"],
        /\bрезины\b/ => ["колес", "автошин", "авторезины"],
        /\bрезину\b/ => ["колеса", "автошины", "авторезину"],
        /\bрезиной\b/ => ["колесами", "автошинами", "авторезиной"],
        /\bрезине\b/ => ["авторезине", "автошинах"]
      }
    },
    "Киев" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.5,
      'replaces' => {
        /вождение/ => "вождение в Киеве и Украине"
      },
      'sinonims' => {
        /\bКиев\b/ => "столица",
        /\bКиева\b/ => "столицы",
        /\bКиеве\b/ => "столице",
        /\bКиеву\b/ => "столицу",
        /\bКиевом\b/ => "столицей"
      }
    },
    "цена" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.5,
      'replaces' => {
        /стоимость/ => "цена",
        /лучший вариант/ => "лучшие цены"
      },
      'sinonims' => {
      }
    },

    "купить" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.7,
      'replaces' => {
        /при выборе подходящего профиля/ => "при покупке шин подходящего профиля",
        /при выборе шин/ => "при покупке шин",
        /\sпри выборе новых шин (новой резины)\s/ => ", когда собираетесь купить новые шины (новую резину) ",
        /выбор шин для/ => "шины, которые можно купить, для",
        /результате, выбор зимних шин/ => "результате, купить зимние шины",
        /результате, выбор летних шин/ => "результате, купить летние шины",
        /нашем варианте присутствуют шины/ => "нашем магазине по лучшим ценам можно купить шины",
        /найдете широкий вариант шин/ => "найдете лучшие цены на весь ассортимент шин"

      },
      'sinonims' => {}
    },
    "размер" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.33,
      'replaces' => {},
      'sinonims' => {
        /\bразмер\b/ => "типоразмер",
        /\bразмера\b/ => "типоразмера",
        /\bразмере\b/ => "типоразмере",
        /\bразмеру\b/ => "типоразмеру",
        /\bразмером\b/ => "типоразмером"
      }
    },
    "выбор" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.4,
      'replaces' => {},
      'sinonims' => {
        /ри выборе шин/ => "ри подборе шин",
        /при выборе подходя/ => "при рассмотрении подходя",
        /\sпри выборе\s(|новых\s)шин/ => ", когда вы собираетесь купить новые шины",
        /\sпри выборе\s(|новой\s)резины/ => ", когда вы собираетесь купить новую резину",
        /ым выбором для/ => "ым решением для",
        /по (В|в)ашему выбору/ => "по вашему заказу",
        /ым выбором/ => "ой покупкой",
        /(В|в)ыбор правильного типа шин/ => "какой тип шин нужно купить",
        /в выборе правильного/ => "в покупке правильного",
        /(В|в)ыбор правильной шины/ => "купить нужные шины",
        /Правильный выбор шин/ => "правильно подобрать и купить шины"
      }

    },
    "заказ" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.5,
      'replaces' => {},
      'sinonims' => {}

    },
    "лето" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.66,
      'replaces' => {
        /выборе\s*шин/ => "выборе летних шин",
        /ной\s*резины/ => "ной летней резины",
        /для\s*шин\s*и/ => "для шин на лето и",
        /с\s*(шинами|резиной)/ => "с летними шинами",
        /размер\s*шин/ => "размер летних шин",
        /(?<=(выборе|размер)\s)(шин)\b/i => "летних шин",
      },
      'sinonims' => {}

    },
    "летние" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.33,
      'replaces' => {
        /выборе\s*шин/ => "выборе летних шин",
        /ной\s*резины/ => "ной летней резины",
        /для\s*шин\s*и/ => "для шин на лето и",
        /с\s*(шинами|резиной)/ => "с летними шинами",
        /размер\s*шин/ => "размер летних шин",
        /(?<=(выборе|размер)\s)(шин)\b/i => "летних шин",

      },
      'sinonims' => {}

    },
    "зима" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.66,
      'replaces' => {
        /(?<=(выборе|размер)\s)(шин)\b/i => "зимних шин",
        /выборе\s*шин/ => "выборе зимних шин",
        /ной\s*резины/ => "ной зимней резины",
        /для\s*шин\s*и/ => "для шин на зиму и",
        /с\s*(шинами|резиной)/ => "с зимними шинами",
        /размер\s*шин/ => "размер зимних шин",

      },
      'sinonims' => {}

    },
    "зимние" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.33,
      'replaces' => {
        /(?<=(выборе|размер)\s)(шин)\b/i => "зимних шин",
        /выборе\s*шин/ => "выборе зимних шин",
        /ной\s*резины/ => "ной зимней резины",
        /для\s*шин\s*и/ => "для шин на зиму и",
        /с\s*(шинами|резиной)/ => "с зимними шинами",
        /размер\s*шин/ => "размер зимних шин",
      },
      'sinonims' => {}

    },
    "всесезонние" => {
      'grup' => 'tyres',
      'keyword_stuffing' => 0.15,
      'replaces' => {
        /(?<=(выборе|размер)\s)(шин)\b/i => "всесезонных шин",
        /выборе\s*шин/ => "выборе всесезонных шин",
        /ной\s*резины/ => "ной всесезонней резины",
        /для\s*шин\s*и/ => "для всесезонных шин и",
        /с\s*(шинами|резиной)/ => "с всесезонними шинами",
        /размер\s*шин/ => "размер всесезонных шин",
      },
      'sinonims' => {}
    },
  }

  TEMPLATE_TEXT_ERROR = [
    "На сайте ПРОКОЛЕСО вы можете купить шины, на лето или зиму: ",
    "Шины, которые можно приобрести в prokoleso.ua: ",
    "У нас  в prokoleso.ua вы найдете шины, которые можно заказать и купить на лето или зиму: ",
    "На сайте ПРОКОЛЕСО вас ждут шины, которые можно заказать и купить на лето или зиму: ",
    "На сайте ПРОКОЛЕСО представлены шины, которые можно заказать и купить на лето или зиму: ",
    "Покупайте у нас шины : ",
    "У нас в продаже шины: ",
    "Шины которые вы можете купить на сайте ПРОКОЛЕСО: ",
    "На сайте ПРОКОЛЕСО  шины можно заказать и купить на лето или зиму: ",
    "Покупайте для зимы и лета здесь шины : ",
    "Шины, представленые на сайте ПРОКОЛЕСО: ",
    "На сайте ПРОКОЛЕСО вы найдете шины для зимы и лета: ",
    "Заказывайте прямо здесь шины : ",
    "Шины , которые вы можете купить для покупки на сайте ПРОКОЛЕСО: ",
    "На сайте ПРОКОЛЕСО распространяются шины: ",
    "Здесь вы можете приобрести резину: ",
    "На сайте ПРОКОЛЕСО доступна резина: ",
    "Резина, которую можно приобрести в prokoleso.ua: ",
    "У нас  в prokoleso.ua вы найдете резину: ",
    "На сайте ПРОКОЛЕСО вас ждет резина: ",
    "На сайте ПРОКОЛЕСО представлена резина: ",
    "Приобретайте у нас резину на Лето, Зиму и Всесезонье: ",
    "У нас в продаже резина, которую можно заказать и купить: ",
    "Резина доступна на сайте ПРОКОЛЕСО: ",
    "На сайте ПРОКОЛЕСО можно заказать и купить резину для зимы и лета: ",
    "Покупайте здесь резину для зимы и лета: ",
    "Резина, представленная На сайте ПРОКОЛЕСО, для зимы и лета: ",
    "На сайте ПРОКОЛЕСО вы можете заказать и купить резину: ",
    "Заказывайте прямо здесь для зимы и лета резину : ",
    "Резина доступна для покупки На сайте ПРОКОЛЕСО: ",
    "На сайте ПРОКОЛЕСО можно купить авторезину: ",
    "Здесь вы можете заказать и купить колеса: ",
    "На сайте ПРОКОЛЕСО вы можете купить колеса: ",
    "Колеса, которые можно заказать и купить в prokoleso.ua: ",
    "У нас  в prokoleso.ua вы можете купить колеса: ",
    "На сайте ПРОКОЛЕСО вас ждут лучшие шины на Лето, Зиму и Всесезонки: ",
    "На сайте ПРОКОЛЕСО представлены лучшие шины на Лето, Зиму и Всесезонные: ",
    "Выбирайте и покупайте у нас колеса : ",
    "У нас в продаже на Лето, Зиму и Всесезоны колеса: ",
    "Колеса которые вы можете купить на сайте ПРОКОЛЕСО: ",
    "На сайте ПРОКОЛЕСО для зимы и лета можно заказать колеса: ",
    "Покупайте для зимы и лета здесь колеса : ",
    "Колеса, представленные для покупки на сайте ПРОКОЛЕСО для зимы и лета: ",
    "На сайте ПРОКОЛЕСО вы можете купить колеса: ",
    "Заказывайте на Лето, Зиму и Всесезонки прямо здесь : ",
    "На сайте ПРОКОЛЕСО покупают шины, на Лето, Зиму и Всесезонки: ",
    'На нашем сайте prokoleso.ua представлены лучшая резина для Лета, Зимы и Всесезонных условий. Здесь вы найдете широкий выбор шин высокого качества, таких как: ',
    'Лучшая резина для Лета, Зимы и Всесезонных эксплуатационных условий доступна на prokoleso.ua. Мы предлагаем разнообразие шин: ',
    'Хотите купить лучшую резину на Лето, Зиму и Всесезонные условия? У нас вас ждет обширный ассортимент шин премиум-класса: ',
    'Купить лучшую резину на Лето, Зиму и Всесезонные периоды стало еще проще с prokoleso.ua. У нас вы найдете широкий ассортимент шин высокого качества: ',
    'Купить лучшую резину для Лета, Зимы и Всесезонных условий стал доступен на prokoleso.ua. Мы предлагаем широкий ассортимент шин от ведущих производителей: ',
    'На prokoleso.ua вы найдете лучшие шины на Лето, Зиму и Всесезонные условия. Мы предлагаем широкий выбор качественных шин: ',
    'Лучшая резина для Лета, Зимы и Всесезонных условий ждет вас на prokoleso.ua. Мы предлагаем широкий ассортимент шин высокого качества: ',
    'Prokoleso.ua – ваш надежный партнер в выборе лучшей резины на Лето, Зиму и Всесезонные периоды. У нас вы найдете широкий выбор шин от ведущих производителей: ',
    'Лучшая резина на Лето, Зиму и Всесезонные доступна для покупки на prokoleso.ua. Мы предлагаем широкий ассортимент шин: ',
    'Хотите купить лучшую резину на Лето, Зиму и Всесезонные условия? У нас на prokoleso.ua, вас ждет большой выбор шин высочайшего качества: ',
    'Хотите приобрести лучшую резину на Лето, Зиму и Всесезонные условия? У нас на prokoleso:ua вы найдете широкий выбор шин высочайшего качества:',
    'Ищете лучшую резину на Лето, Зиму и Всесезонные условия? Заходите на prokoleso:ua - у нас большой ассортимент шин высокого качества:',
    'Планируете купить лучшую резину на Лето, Зиму и Всесезонные условия? Загляните на prokoleso:ua, где вас ждет обширный выбор шин премиум-класса:',
    'В поисках лучшей резины на Лето, Зиму и Всесезонные условия? Посетите prokoleso:ua - у нас большой выбор высококачественных шин:',
    'Желаете купить лучшую резину на Лето, Зиму и Всесезонные условия? Заходите на prokoleso:ua, где представлен огромный выбор шин высочайшего уровня:',
    'Предпочитаете лучшую резину на Лето, Зиму и Всесезонные условия? Вас ждет широкий ассортимент шин премиум-класса на prokoleso:ua:',
    'Ищете оптимальную резину на Лето, Зиму и Всесезонные условия? Загляните на prokoleso:ua, где представлен большой выбор шин высокого качества:',
    'Планируете купить резину на Лето, Зиму и Всесезонные условия? У нас на prokoleso:ua вы найдете обширный ассортимент шин премиум-класса:',
    'В поисках качественной резины на Лето, Зиму и Всесезонные условия? Посетите prokoleso:ua - у нас большой выбор шин высочайшего уровня:',
    'Желаете купить качественную резину на Лето, Зиму и Всесезонные условия? Заходите на prokoleso:ua, где представлен широкий ассортимент высококлассных шин:',
    'Предпочитаете качественную резину на Лето, Зиму и Всесезонные условия? Вас ждет обширный выбор шин премиум-класса на prokoleso:ua:',
    'Ищете оптимальную резину на Лето, Зиму и Всесезонные условия? Загляните на prokoleso:ua, где представлен большой выбор шин высокого качества:',
    'Планируете купить резину на Лето, Зиму и Всесезонные условия? У нас на prokoleso:ua вы найдете обширный ассортимент шин премиум-класса:',
    'В поисках качественной резины на Лето, Зиму и Всесезонные условия? Посетите prokoleso:ua - у нас большой выбор шин высочайшего уровня:',
    'Желаете купить качественную резину на Лето, Зиму и Всесезонные условия? Заходите на prokoleso:ua, где представлен широкий ассортимент высококлассных шин:',
    'Предпочитаете качественную резину на Лето, Зиму и Всесезонные условия? Вас ждет обширный выбор шин премиум-класса на prokoleso:ua:',
    'Ищете оптимальную резину на Лето, Зиму и Всесезонные условия? Загляните на prokoleso:ua, где представлен большой выбор шин высокого качества:',
    'Планируете купить резину на Лето, Зиму и Всесезонные условия? У нас на prokoleso:ua вы найдете обширный ассортимент шин премиум-класса:',
    'В поисках качественной резины на Лето, Зиму и Всесезонные условия? Посетите prokoleso:ua - у нас большой выбор шин высочайшего уровня:',
    'Желаете купить качественную резину на Лето, Зиму и Всесезонные условия? Заходите на prokoleso:ua, где представлен широкий ассортимент высококлассных шин:',
    'Вас ожидает лучшая резина для Лета, Зимы и Всесезонных условий на prokoleso.ua. Предлагаем широкий выбор шин высокого качества:',
    'У нас на prokoleso.ua вас ждет лучшая резина для Лета, Зимы и Всесезонных условий. Разнообразие шин высшего качества в вашем распоряжении:',
    'Лучшая резина для Лета, Зимы и Всесезонных условий доступна на prokoleso.ua. У нас вы найдете разнообразие шин высочайшего качества:',
    'Загляните на prokoleso.ua - здесь вас ждет лучшая резина для Лета, Зимы и Всесезонных условий. Мы предлагаем широкий ассортимент шин высокого качества:',
    'Вас ждет лучшая резина для Лета, Зимы и Всесезонных условий на prokoleso.ua. Представлен широкий выбор шин превосходного качества:',
    'Лучшая резина для Лета, Зимы и Всесезонных условий уже ждет вас на prokoleso.ua. Мы предлагаем разнообразие шин высокого качества:',
    'Ищете лучшую резину для Лета, Зимы и Всесезонных условий? Заходите на prokoleso.ua - у нас широкий ассортимент шин высокого качества:',
    'У нас на prokoleso.ua вы найдете лучшую резину для Лета, Зимы и Всесезонных условий. Мы предлагаем разнообразие шин высочайшего качества:',
    'Вас ждет лучшая резина для Лета, Зимы и Всесезонных условий на prokoleso.ua. Представлен широкий ассортимент шин высочайшего качества:',
    'Лучшая резина для Лета, Зимы и Всесезонных условий доступна на prokoleso.ua. Мы предлагаем разнообразие шин высшего качества:',
    'Загляните на prokoleso.ua - здесь вас ожидает лучшая резина для Лета, Зимы и Всесезонных условий. Мы предлагаем широкий выбор шин превосходного качества:',
    'Ищете лучшую резину для Лета, Зимы и Всесезонных условий? Заходите на prokoleso.ua - у нас разнообразие шин высочайшего качества:',
    'У нас на prokoleso.ua вас ждет лучшая резина для Лета, Зимы и Всесезонных условий. Мы предлагаем разнообразие шин высшего качества:',
    'Вас ждет лучшая резина для Лета, Зимы и Всесезонных условий на prokoleso.ua. Представлен широкий ассортимент шин превосходного качества:',
    'Лучшая резина для Лета, Зимы и Всесезонных условий доступна на prokoleso.ua. У нас представлен широкий выбор шин высочайшего качества:',
    'Загляните на prokoleso.ua - здесь вас ожидает лучшая резина для Лета, Зимы и Всесезонных условий. Мы предлагаем широкий выбор шин превосходного качества:',
    'Ищете лучшую резину для Лета, Зимы и Всесезонных условий? Заходите на prokoleso.ua - у нас разнообразие шин высшего качества:',
    'У нас на prokoleso.ua вас ждет лучшая резина для Лета, Зимы и Всесезонных условий. Мы предлагаем разнообразие шин высочайшего качества:',
    'Вас ждет лучшая резина для Лета, Зимы и Всесезонных условий на prokoleso.ua. Представлен широкий ассортимент шин превосходного качества:',
    'Лучшая резина для Лета, Зимы и Всесезонных условий доступна на prokoleso.ua. Мы предлагаем разнообразие шин высшего качества:',
    'Планируете обновить резину для своего автомобиля? У нас на вас ожидает самый широкий выбор шин премиум-класса:',
    'Ищете лучшую резину для вашего автомобиля? У нас представлен самый обширный ассортимент шин премиум-класса:',
    'Вас интересует покупка лучшей резины для вашего автомобиля? У нас вас ждет самый разнообразный выбор шин премиум-класса:',
    'Желаете приобрести лучшую резину для своего автомобиля? Загляните к нам - у нас самый обширный ассортимент шин премиум-класса:',
    'Планируете приобрести лучшую резину для своего автомобиля? У нас вас ожидает самый большой выбор шин премиум-класса:',
    'Вас интересует покупка самой лучшей резины для вашего автомобиля? Загляните к нам - у нас самый широкий ассортимент шин премиум-класса:',
    'Желаете обновить резину для своего автомобиля? У нас на вас ждет самый разнообразный выбор шин премиум-класса:',
    'Планируете купить лучшую резину для вашего автомобиля? Загляните к нам - у нас самый обширный ассортимент шин премиум-класса:',
    'Вас интересует приобретение лучшей резины для своего автомобиля? У нас представлен самый большой выбор шин премиум-класса:',
    'Желаете приобрести самую лучшую резину для вашего автомобиля? Загляните к нам - у нас самый разнообразный выбор шин премиум-класса:',
    'Планируете купить самую лучшую резину для своего автомобиля? У нас представлен самый обширный ассортимент шин премиум-класса:',
    'Вас интересует покупка лучшей резины для вашего автомобиля? Загляните к нам - у нас самый большой выбор шин премиум-класса:',
    'Желаете обновить резину для своего автомобиля? У нас представлен самый обширный ассортимент шин премиум-класса:',
    'Планируете приобрести самую лучшую резину для вашего автомобиля? Загляните к нам - у нас самый разнообразный выбор шин премиум-класса:',
    'Вас интересует покупка лучшей резины для своего автомобиля? У нас на вас ждет самый обширный ассортимент шин премиум-класса:',
    'Желаете обновить резину для вашего автомобиля? Загляните к нам - у нас самый большой выбор шин премиум-класса:',
    'Планируете приобрести самую лучшую резину для вашего автомобиля? У нас представлен самый обширный ассортимент шин премиум-класса:',
    'Вас интересует покупка лучшей резины для своего автомобиля? Загляните к нам - у нас самый разнообразный выбор шин премиум-класса:',
    'Желаете обновить резину для своего автомобиля? У нас на вас ждет самый обширный ассортимент шин премиум-класса:',
    'Планируете купить лучшую резину для вашего автомобиля? Загляните к нам - у нас самый большой выбор шин премиум-класса:',
    'Выбирайте только лучшие шины на сайте ПРОКОЛЕСО. У нас вы можете заказать и купить качественную резину:',
    'Только у нас на сайте ПРОКОЛЕСО представлены лучшие шины. Закажите и купите резину прямо сейчас:',
    'Лучшие шины ждут вас на сайте ПРОКОЛЕСО. Закажите и купите резину легко и быстро:',
    'Покупайте только лучшие шины на сайте ПРОКОЛЕСО. У нас вы найдете резину высокого качества:',
    'Только у нас на сайте ПРОКОЛЕСО представлены шины высочайшего качества. Закажите и купите резину без лишних хлопот:',
    'Лучшие шины доступны на сайте ПРОКОЛЕСО. Закажите и купите резину для вашего автомобиля сейчас:',
    'Покупайте качественную резину на сайте ПРОКОЛЕСО. У нас только лучшие шины для вашего автомобиля:',
    'Только у нас на сайте ПРОКОЛЕСО вы найдете лучшие шины. Закажите и купите резину с доставкой до дома:',
    'Лучшие шины для вашего автомобиля доступны на сайте ПРОКОЛЕСО. Закажите и купите резину онлайн:',
    'Покупайте только лучшие шины на сайте ПРОКОЛЕСО. У нас вы найдете широкий выбор качественной резины:',
    'Только у нас на сайте ПРОКОЛЕСО представлены шины высшего качества. Закажите и купите резину прямо сейчас:',
    'Лучшие шины ждут вас на сайте ПРОКОЛЕСО. Покупайте резину безопасно и удобно:',
    'Покупайте качественную резину на сайте ПРОКОЛЕСО. У нас только лучшие шины для вашего автомобиля:',
    'Только у нас на сайте ПРОКОЛЕСО вы найдете лучшие шины. Закажите и купите резину с доставкой до дома:',
    'Лучшие шины для вашего автомобиля доступны на сайте ПРОКОЛЕСО. Закажите и купите резину онлайн:',
    'Покупайте только лучшие шины на сайте ПРОКОЛЕСО. У нас вы найдете широкий выбор качественной резины:',
    'Только у нас на сайте ПРОКОЛЕСО представлены шины высшего качества. Закажите и купите резину прямо сейчас:',
    'Лучшие шины ждут вас на сайте ПРОКОЛЕСО. Покупайте резину безопасно и удобно:',
    'Покупайте качественную резину на сайте ПРОКОЛЕСО. У нас только лучшие шины для вашего автомобиля:',
    'Только у нас на сайте ПРОКОЛЕСО вы найдете лучшие шины. Закажите и купите резину с доставкой до дома:',
    'У нас вы можете заказать и купить колеса прямо сейчас:',
    'Закажите и купите колеса у нас:',
    'Колеса доступны для заказа и покупки прямо здесь:',
    'Вы можете приобрести колеса у нас:',
    'У нас есть возможность заказа и покупки колес:',
    'Приобретайте колеса у нас:',
    'Заказывайте и покупайте колеса у нас:',
    'У нас вы найдете колеса для заказа и покупки:',
    'Здесь можно заказать и купить колеса:',
    'У нас есть широкий выбор колес для заказа и покупки:',
    'Покупайте колеса прямо здесь:',
    'Выбирайте и покупайте колеса у нас:',
    'Заказ колес доступен у нас:',
    'Покупка колес доступна у нас:',
    'У нас можно заказать и купить колеса:',
    'Колеса ждут вас для заказа и покупки:',
    'Вы можете приобрести колеса у нас:',
    'Закажите и купите колеса прямо здесь:',
    'У нас есть возможность заказа и покупки колес:',
    'Приобретайте колеса у нас:',
    'Закажите и купите шины на лето или зиму на сайте ПРОКОЛЕСО:',
    'У нас на сайте ПРОКОЛЕСО вы можете заказать и приобрести шины на лето или зиму:',
    'На сайте ПРОКОЛЕСО доступны для заказа и покупки шины на лето или зиму:',
    'Шины на лето или зиму можно заказать и купить на сайте ПРОКОЛЕСО:',
    'Выбирайте и приобретайте шины на лето или зиму на сайте ПРОКОЛЕСО:',
    'Заказать и купить шины на лето или зиму легко и быстро на сайте ПРОКОЛЕСО:',
    'На сайте ПРОКОЛЕСО вы найдете широкий выбор шин на лето или зиму для заказа и покупки:',
    'Заказ и покупка шин на лето или зиму доступны на сайте ПРОКОЛЕСО:',
    'Приобретайте шины на лето или зиму на сайте ПРОКОЛЕСО:',
    'Шины на лето или зиму ждут вас для заказа и покупки на сайте ПРОКОЛЕСО:',
    'Закажите и купите шины на лето или зиму на сайте ПРОКОЛЕСО:',
    'На сайте ПРОКОЛЕСО можно заказать и купить шины на лето или зиму:',
    'Шины на лето или зиму доступны для заказа и покупки на сайте ПРОКОЛЕСО:',
    'Покупка шин на лето или зиму возможна на сайте ПРОКОЛЕСО:',
    'Заказ и покупка шин на лето или зиму легки и удобны на сайте ПРОКОЛЕСО:',
    'Выберите и приобретите шины на лето или зиму на сайте ПРОКОЛЕСО:',
    'Закажите и купите шины на лето или зиму прямо сейчас на сайте ПРОКОЛЕСО:',
    'Шины на лето или зиму доступны для заказа и покупки на сайте ПРОКОЛЕСО:',
    'Покупка шин на лето или зиму легко доступна на сайте ПРОКОЛЕСО:',
    'Приобретайте шины на лето или зиму на сайте ПРОКОЛЕСО:',
    'У нас на сайте ПРОКОЛЕСО шины на лето или зиму можно заказать и купить:',
    'Закажите и купите шины на лето или зиму на сайте ПРОКОЛЕСО уже сегодня:',
    'На сайте ПРОКОЛЕСО вы найдете широкий ассортимент шин на лето или зиму для заказа и покупки:',
    'Шины на лето или зиму доступны для заказа и покупки на сайте ПРОКОЛЕСО:',
    'Приобретайте шины на лето или зиму на сайте ПРОКОЛЕСО:',
    'Выберите и закажите шины на лето или зиму на сайте ПРОКОЛЕСО:',
    'Закажите и получите шины на лето или зиму у нас на сайте ПРОКОЛЕСО:',
    'Шины на лето или зиму ожидают вас для заказа и покупки на сайте ПРОКОЛЕСО:',
    'Закажите и купите шины на лето или зиму на сайте ПРОКОЛЕСО сейчас:',
    'На сайте ПРОКОЛЕСО можно легко заказать и купить шины на лето или зиму:',
    'Приобретайте шины на лето или зиму без лишних усилий на сайте ПРОКОЛЕСО:',
    'У нас на сайте ПРОКОЛЕСО широкий выбор шин на лето или зиму для заказа и покупки:',
    'Заказ и покупка шин на лето или зиму на сайте ПРОКОЛЕСО проходят быстро и удобно:',
    'Покупайте шины на лето или зиму у нас на сайте ПРОКОЛЕСО с уверенностью в качестве:',
    'Выбирайте шины на лето или зиму из нашего ассортимента на сайте ПРОКОЛЕСО:',
    'Закажите и получите шины на лето или зиму на ваш адрес с помощью сайта ПРОКОЛЕСО:',
    'Шины на лето или зиму доступны для заказа и покупки прямо сейчас на сайте ПРОКОЛЕСО:',
    'Покупка шин на лето или зиму на сайте ПРОКОЛЕСО - это просто и удобно:',
    'Закажите и купите шины на лето или зиму с доставкой на сайте ПРОКОЛЕСО:',
    'Выберите и закажите шины на лето или зиму прямо сейчас на сайте ПРОКОЛЕСО:',
    'Приобретайте шины на лето или зиму с гарантией качества на сайте ПРОКОЛЕСО:',
    'Закажите шины на лето или зиму и получите быструю доставку от ПРОКОЛЕСО:',
    'У нас на сайте ПРОКОЛЕСО самый широкий выбор шин на лето или зиму:',
    'Покупка шин на лето или зиму на сайте ПРОКОЛЕСО - это надежно и удобно:',
    'Заказывайте шины на лето или зиму и экономьте время на сайте ПРОКОЛЕСО:',
    'Выберите качественные шины на лето или зиму по выгодной цене на сайте ПРОКОЛЕСО:',
    'Покупайте шины на лето или зиму с уверенностью в их надежности на сайте ПРОКОЛЕСО:',
    'Закажите шины на лето или зиму и наслаждайтесь комфортной поездкой с ПРОКОЛЕСО:',
    'Приобретайте шины на лето или зиму без лишних хлопот на сайте ПРОКОЛЕСО:',
    'У нас на сайте ПРОКОЛЕСО вы найдете шины на лето или зиму для любых потребностей:',
    'Закажите качественные шины на лето или зиму и наслаждайтесь комфортной ездой с ПРОКОЛЕСО:',
    'Выбирайте шины на лето или зиму из лучших брендов на сайте ПРОКОЛЕСО:',
    'Приобретайте шины на лето или зиму с уверенностью в их производительности на сайте ПРОКОЛЕСО:',
    'Закажите шины на лето или зиму и получите отличное качество на сайте ПРОКОЛЕСО:',
    'Покупайте шины на лето или зиму с гарантией качества и надежности на сайте ПРОКОЛЕСО:',
    'Закажите шины на лето или зиму и наслаждайтесь безопасной ездой с ПРОКОЛЕСО:',
    'Выберите шины на лето или зиму, соответствующие вашим потребностям, на сайте ПРОКОЛЕСО:',
    'Приобретайте шины на лето или зиму с высокими показателями безопасности на сайте ПРОКОЛЕСО:',
    'Закажите шины на лето или зиму и получите их быстро и удобно на сайте ПРОКОЛЕСО:',
    'Покупайте шины на лето или зиму и наслаждайтесь высоким уровнем комфорта в поездках с ПРОКОЛЕСО:',
    'Вас ждут шины на лето или зиму на prokoleso.ua:',
    'У нас на prokoleso.ua вы найдете шины на лето или зиму:',
    'На prokoleso.ua доступны шины для лета и зимы:',
    'Покупайте шины на лето или зиму на prokoleso.ua:',
    'В prokoleso.ua шины на лето или зиму уже в наличии:',
    'Выбирайте шины на лето или зиму на prokoleso.ua:',
    'Закажите шины для лета или зимы на prokoleso.ua:',
    'Приобретайте шины на лето или зиму на prokoleso.ua:',
    'Ваш выбор — шины на лето или зиму на prokoleso.ua:',
    'У нас в ассортименте шины для лета и зимы на prokoleso.ua:',
    'На prokoleso.ua представлены шины на лето или зиму:',
    'Шины на лето или зиму доступны для заказа на prokoleso.ua:',
    'Покупайте шины на лето или зиму прямо сейчас на prokoleso.ua:',
    'В prokoleso.ua вы найдете шины, подходящие для лета и зимы:',
    'Заказывайте шины на лето или зиму на prokoleso.ua уже сегодня:',
    'Шины на лето или зиму ждут вас на prokoleso.ua:',
    'На prokoleso.ua представлен широкий выбор шин для лета и зимы:',
    'Шины на лето или зиму представлены на prokoleso.ua:',
    'Вас ждут шины, которые можно заказать и купить на лето или зиму, на prokoleso.ua:',
    'Преобретайте шины на лето или зиму у нас на prokoleso.ua:',
    'Погрузитесь в мир шин на лето или зиму с нашим ассортиментом на prokoleso.ua:',
    'Ваш автомобиль заслуживает лучших шин на лето или зиму, которые вы найдете на prokoleso.ua:',
    'Откройте для себя разнообразие моделей шин для лета и зимы на prokoleso.ua:',
    'Планируйте свои поездки безопасно и уверенно, выбрав шины на лето или зиму из нашего каталога на prokoleso.ua:',
    'Предоставляем вам возможность выбора из широкого ассортимента шин на лето или зиму на prokoleso.ua:',
    'На prokoleso.ua вы найдете не просто шины на лето или зиму, а источник уверенности на дороге:',
    'Подготовьте свой автомобиль к различным условиям с шинами на лето или зиму, доступными на prokoleso.ua:',
    'На prokoleso.ua вы сможете подобрать идеальные шины на лето или зиму, соответствующие вашим требованиям:',
    'Ваш выбор — наши шины на лето или зиму, гарантирующие комфорт и безопасность, доступные на prokoleso.ua:',
    'Покупайте шины на лето или зиму с уверенностью, основываясь на широком ассортименте на prokoleso.ua:',
    'На prokoleso.ua вы найдете шины на лето или зиму, которые будут идеальным сочетанием цены и качества:',
    'Оснастите свой автомобиль шинами на лето или зиму, представленными на prokoleso.ua, и наслаждайтесь комфортной ездой:',
    'На prokoleso.ua представлены шины на лето или зиму различных брендов и моделей для удовлетворения любых потребностей:',
    'Сделайте правильный выбор в пользу шин на лето или зиму, доступных в нашем интернет-магазине prokoleso.ua:',
    'Подберите оптимальные шины на лето или зиму для вашего автомобиля из нашего каталога на prokoleso.ua:',
    'Ваша безопасность и комфорт на дороге - наш приоритет с шинами на лето или зиму от prokoleso.ua:',
    'На prokoleso.ua вы найдете широкий выбор шин на лето или зиму, соответствующий вашим требованиям и бюджету:',
    'Путешествуйте безопасно и уверенно с шинами на лето или зиму, доступными для заказа на prokoleso.ua:',
    'Выберите идеальные шины на лето или зиму из нашего ассортимента на prokoleso.ua и оцените их качество и надежность:',
    'На prokoleso.ua вы найдете шины на лето или зиму, которые обеспечат вам спокойствие и безопасность на дороге:'

  ]

  TEMPLATE_TEXT_DISKI_ERROR_UA = [
    "Купуйте для зими і літа диски:",
    "Диски, представлені на сайті ПРОКОЛЕСО:",
    "На сайті ПРОКОЛЕСО ви знайдете диски для зими і літа:",
    "Замовляйте прямо тут диски:",
    "Диски, які ви можете купити для покупки на сайті ПРОКОЛЕСО:",
    "Тут ви можете придбати колеса:",
    "На сайті ПРОКОЛЕСО доступні колеса:",
    "Колеса, які можна придбати на prokoleso.ua:",
    "У нас в prokoleso.ua ви знайдете колеса:",
    "На сайті ПРОКОЛЕСО вас чекають колеса:",
    "На сайті ПРОКОЛЕСО представлені колеса:",
    "У нас в продажу колеса, які можна замовити та придбати:",
    "Колеса доступні на сайті ПРОКОЛЕСО:",
    "На сайті ПРОКОЛЕСО можна замовити та придбати колеса для зими і літа:",
    "Покупайте тут колеса для зими і літа:",
    "Колеса, представлені на сайті ПРОКОЛЕСО, для зими і літа:",
    "На сайті ПРОКОЛЕСО ви можете замовити та придбати колеса:",
    "Замовляйте прямо тут для зими і літа колеса:",
    "Колеса доступна для покупки на сайті ПРОКОЛЕСО:",
    "На сайті ПРОКОЛЕСО можна купити автоколеса:",
    "Тут ви можете замовити та придбати  диски:",
    "На сайті ПРОКОЛЕСО ви можете купити  диски:",
    "Диски, які можна замовити та придбати в prokoleso.ua:",
    "У нас в prokoleso.ua ви можете купити  диски:",
    "На сайті ПРОКОЛЕСО вас чекають найкращі диски :",
    "На сайті ПРОКОЛЕСО представлені найкращі диски :",
    "Вибирайте та купуйте у нас диски:",
    "У нас в продажу на диски:",
    "Диски, які ви можете купити на сайті ПРОКОЛЕСО:",
    "На сайті PROKOLESO можна замовити та купити диски:",
    "Придбайте на prokoleso.ua диски :",
    "Диски, доступні для покупки на сайті PROKOLESO для зими та літа:",
    "На сайті PROKOLESO можна купити диски:",
    "На нашому сайті prokoleso.ua представлена найкраща резина для літа, зими та всесезонних умов. Тут ви знайдете широкий вибір високоякісних дисков, таких як:",
    "Найкращі легкосплавные диски доступні на prokoleso.ua. Ми пропонуємо різноманіття дисків:",
    "Хочете купити найкращі диски? У нас вас чекає широкий асортимент дисків преміум-класу:",
    "Купити найкращі диски  стало ще простіше з prokoleso.ua. У нас ви знайдете широкий асортимент високоякісних дисків:",
    "Купити найкращі диски для літа, зими та всесезонних умов тепер доступно на prokoleso.ua. Ми пропонуємо широкий асортимент дисків від провідних виробників:",
    "На prokoleso.ua ви знайдете найкращі диски. Ми пропонуємо широкий вибір якісних дисків:",
    "Широкий вибір найкращих дисків доступний на сайті prokoleso.ua:",
    "Найкращі легкосплавні диски чекають на вас на prokoleso.ua:",
    "Знайдіть найкращі диски на prokoleso.ua та купуйте з комфортом:",
    "Професійні консультанти допоможуть вам обрати найкращі диски на prokoleso.ua:",
    "Професійні консультанти допоможуть вам обрати найкращі диски на prokoleso.ua:",
    "Отримайте допомогу професійних консультантів при виборі найкращих дисків на prokoleso.ua:",
    "Наші експерти допоможуть вам підібрати найкращі диски на prokoleso.ua:",
    "Не знаєте, які диски обрати? Зверніться до наших професійних консультантів на prokoleso.ua та купуйте:",
    "Скористайтеся допомогою професійних консультантів для вибору найкращих дисків на prokoleso.ua та купуйте:",
    "На prokoleso.ua вас чекають досвідчені консультанти, готові допомогти вибрати найкращі диски:",
    "Не впевнені в своєму виборі? Наші консультанти на prokoleso.ua допоможуть вам обрати найкращі диски:",
    "Хочете отримати рекомендації щодо вибору дисків? Звертайтеся до наших консультантів на prokoleso.ua та купуйте:",
    "Обирайте диски за допомогою наших професійних консультантів на prokoleso.ua:",
    "На prokoleso.ua доступна допомога консультантів при виборі найкращих дисків:",
    "Отримайте експертну допомогу при виборі дисків на prokoleso.ua та купуйте:",
    "Не знаєте, які диски підійдуть? Звертайтеся до наших консультантів на prokoleso.ua та купуйте:",
    "На prokoleso.ua вас чекають кваліфіковані консультанти, готові допомогти вибрати найкращі диски:",
    "У вас є питання щодо вибору дисків? Зверніться до наших фахівців на prokoleso.ua та купуйте:",
    "На prokoleso.ua працюють досвідчені консультанти, які допоможуть вам вибрати найкращі диски:",
    "Не впевнені, які диски обрати? Отримайте допомогу наших консультантів на prokoleso.ua та купуйте:",
    "Хочете зробити правильний вибір дисків? Зверніться до наших консультантів на prokoleso.ua та купуйте:",
    "На prokoleso.ua ви можете отримати рекомендації від професіоналів щодо вибору дисків:",
    "Не знаєте, які диски краще обрати? Наші консультанти на prokoleso.ua допоможуть вам зробити правильний вибір:",
    "Хочете обрати ідеальні диски? Отримайте допомогу наших консультантів на prokoleso.ua та купуйте:"
  ]

  TEMPLATE_TEXT_DISKI_ERROR = [
    "Покупайте для зимы и лета диски:",
    "Диски, представленные на сайте ПРОКОЛЕСО:",
    "На сайте ПРОКОЛЕСО вы найдете диски для зимы и лета:",
    "Заказывайте прямо здесь диски:",
    "Диски, которые вы можете приобрести на сайте ПРОКОЛЕСО:",
    "Здесь вы можете приобрести колеса:",
    "На сайте ПРОКОЛЕСО доступны колеса:",
    "Колеса, которые можно приобрести на prokoleso.ua:",
    "У нас на prokoleso.ua вы найдете колеса:",
    "На сайте ПРОКОЛЕСО вас ждут колеса:",
    "На сайте ПРОКОЛЕСО представлены колеса:",
    "У нас в продаже колеса, которые можно заказать и приобрести:",
    "Колеса доступны на сайте ПРОКОЛЕСО:",
    "На сайте ПРОКОЛЕСО можно заказать и приобрести колеса для зимы и лета:",
    "Покупайте здесь колеса для зимы и лета:",
    "Колеса, представленные на сайте ПРОКОЛЕСО, для зимы и лета:",
    "На сайте ПРОКОЛЕСО вы можете заказать и приобрести колеса:",
    "Заказывайте прямо здесь для зимы и лета колеса:",
    "Колеса доступны для покупки на сайте ПРОКОЛЕСО:",
    "На сайте ПРОКОЛЕСО можно купить автоколеса:",
    "Здесь вы можете заказать и приобрести диски:",
    "На сайте ПРОКОЛЕСО вы можете купить диски:",
    "Диски, которые можно заказать и приобрести на prokoleso.ua:",
    "У нас на prokoleso.ua вы можете купить диски:",
    "На сайте ПРОКОЛЕСО вас ждут лучшие диски:",
    "На сайте ПРОКОЛЕСО представлены лучшие диски:",
    "Выбирайте и покупайте у нас диски:",
    "У нас в продаже диски:",
    "Диски, которые вы можете купить на сайте ПРОКОЛЕСО:",
    "На сайте PROKOLESO можно заказать и купить диски:",
    "Приобретайте на prokoleso.ua диски:",
    "Диски доступны для покупки на сайте PROKOLESO для зимы и лета:",
    "На сайте PROKOLESO можно купить диски:",
    "На нашем сайте prokoleso.ua представлена лучшая резина для лета, зимы и всесезонных условий. Здесь вы найдете широкий выбор высококачественных дисков, таких как:",
    "Лучшие легкосплавные диски доступны на prokoleso.ua. Мы предлагаем разнообразие дисков:",
    "Желаете приобрести лучшие диски? У нас вас ждет широкий ассортимент дисков премиум-класса:",
    "Покупка лучших дисков стала еще проще с prokoleso.ua. У нас вы найдете широкий ассортимент высококачественных дисков:",
    "Покупка лучших дисков для лета, зимы и всесезонных условий теперь доступна на prokoleso.ua. Мы предлагаем широкий ассортимент дисков от ведущих производителей:",
    "На prokoleso.ua вы найдете лучшие диски. Мы предлагаем широкий выбор качественных дисков:",
    "Широкий выбор лучших дисков доступен на сайте prokoleso.ua:",
    "Лучшие легкосплавные диски ждут вас на prokoleso.ua:",
    "Найдите лучшие диски на prokoleso.ua и покупайте с комфортом:",
    "Профессиональные консультанты помогут вам выбрать лучшие диски на prokoleso.ua:",
    "Профессиональные консультанты помогут вам выбрать лучшие диски на prokoleso.ua:",
    "Получите помощь профессиональных консультантов при выборе лучших дисков на prokoleso.ua и покупайте:",
    "Наши эксперты помогут вам подобрать лучшие диски на prokoleso.ua:",
    "Не знаете, какие диски выбрать? Обратитесь к нашим профессиональным консультантам на prokoleso.ua и покупайте:",
    "Воспользуйтесь помощью профессиональных консультантов для выбора лучших дисков на prokoleso.ua и покупайте:",
    "На prokoleso.ua вас ждут опытные консультанты, готовые помочь выбрать лучшие диски:",
    "Не уверены в своем выборе? Наши консультанты на prokoleso.ua помогут вам выбрать лучшие диски:",
    "Хотите получить рекомендации по выбору дисков? Обращайтесь к нашим консультантам на prokoleso.ua и покупайте:",
    "Выбирайте диски с помощью наших профессиональных консультантов на prokoleso.ua и покупайте:",
    "На prokoleso.ua доступна помощь консультантов при выборе лучших дисков:",
    "Получите экспертную помощь при выборе дисков на prokoleso.ua и покупайте:",
    "Не знаете, какие диски подойдут? Обратитесь к нашим консультантам на prokoleso.ua и покупайте:",
    "На prokoleso.ua вас ждут квалифицированные консультанты, готовые помочь выбрать лучшие диски:",
    "У вас есть вопросы по выбору дисков? Обратитесь к нашим специалистам на prokoleso.ua и покупайте:",
    "На prokoleso.ua работают опытные консультанты, которые помогут вам выбрать лучшие диски:",
    "Не уверены, какие диски выбрать? Получите помощь наших консультантов на prokoleso.ua и покупайте:",
    "Хотите сделать правильный выбор дисков? Обратитесь к нашим консультантам на prokoleso.ua и покупайте:",
    "На prokoleso.ua вы можете получить рекомендации от профессионалов по выбору дисков:",
    "Не знаете, какие диски лучше выбрать? Наши консультанты на prokoleso.ua помогут вам сделать правильный выбор:",
    "Хотите выбрать идеальные диски? Получите помощь наших консультантов на prokoleso.ua и покупайте:"

  ]

  TEMPLATE_TEXT_ERROR_UA = [
    'Купуйте для зими і літа тут шини:',
    'Шини, представлені на сайті ПРОКОЛЕСО:',
    'На сайті ПРОКОЛЕСО ви знайдете шини для зими і літа:',
    'Замовляйте прямо тут шини:',
    'Шини , які ви можете купити для покупки на сайті ПРОКОЛЕСО:',
    'На сайті ПРОКОЛЕСО розповсюджуються шини:',
    'Тут ви можете придбати резину:',
    'На сайті ПРОКОЛЕСО доступна резина:',
    'Резина, яку можна придбати на prokoleso.ua:',
    'У нас в prokoleso.ua ви знайдете резину:',
    'На сайті ПРОКОЛЕСО вас чекає резина:',
    'На сайті ПРОКОЛЕСО представлена резина:',
    'Придбайте у нас резину на Літо, Зиму та Всесезоння:',
    'У нас в продажу резина, яку можна замовити та придбати:',
    'Резина доступна на сайті ПРОКОЛЕСО:',
    'На сайті ПРОКОЛЕСО можна замовити та придбати резину для зими і літа:',
    'Покупайте тут резину для зими і літа:',
    'Резина, представлена на сайті ПРОКОЛЕСО, для зими і літа:',
    'На сайті ПРОКОЛЕСО ви можете замовити та придбати резину:',
    'Замовляйте прямо тут для зими і літа резину:',
    'Резина доступна для покупки на сайті ПРОКОЛЕСО:',
    'На сайті ПРОКОЛЕСО можна купити авторезину:',
    'Тут ви можете замовити та придбати колеса:',
    'На сайті ПРОКОЛЕСО ви можете купити колеса:',
    'Колеса, які можна замовити та придбати в prokoleso.ua:',
    'У нас в prokoleso.ua ви можете купити колеса:',
    'На сайті ПРОКОЛЕСО вас чекають найкращі шини на Літо, Зиму та Всесезонки:',
    'На сайті ПРОКОЛЕСО представлені найкращі шини на Літо, Зиму та Всесезонні:',
    'Вибирайте та купуйте у нас колеса:',
    'У нас в продажу на Літо, Зиму та Всесезонки колеса:',
    'Колеса, які ви можете купити на сайті ПРОКОЛЕСО:',
    'На сайті PROKOLESO можна замовити колеса для зими та літа:',
    'Придбайте на prokoleso.ua колеса для зими та літа:',
    'Колеса, доступні для покупки на сайті PROKOLESO для зими та літа:',
    'На сайті PROKOLESO можна купити колеса:',
    'Замовляйте прямо тут на літо, зиму та всесезонні колеса:',
    'На сайті PROKOLESO шини придбають для літа, зими та всесезонного використання:',
    'На нашому сайті prokoleso.ua представлена найкраща резина для літа, зими та всесезонних умов. Тут ви знайдете широкий вибір високоякісних шин, таких як:',
    'Найкраща резина для літа, зими та всесезонних умов доступна на prokoleso.ua. Ми пропонуємо різноманіття шин:',
    'Хочете купити найкращу резину на літо, зиму та всесезонні умови? У нас вас чекає широкий асортимент шин преміум-класу:',
    'Купити найкращу резину на літо, зиму та всесезонні періоди стало ще простіше з prokoleso.ua. У нас ви знайдете широкий асортимент високоякісних шин:',
    'Купити найкращу резину для літа, зими та всесезонних умов тепер доступно на prokoleso.ua. Ми пропонуємо широкий асортимент шин від провідних виробників:',
    'На prokoleso.ua ви знайдете найкращі шини на літо, зиму та всесезонні умови. Ми пропонуємо широкий вибір якісних шин:',
    'Найкраща резина для літа, зими та всесезонних умов чекає на вас на prokoleso.ua. Ми пропонуємо широкий асортимент високоякісних шин:',
    'PROKOLESO.ua – ваш надійний партнер у виборі найкращої резини на літо, зиму та всесезонні періоди. У нас ви знайдете широкий вибір шин від провідних виробників:',
    'Найкраща резина на літо, зиму та всесезонне використання доступна для покупки на prokoleso.ua. Ми пропонуємо широкий асортимент шин:',
    'Хочете купити найкращу резину на літо, зиму та всесезонні умови? У нас на prokoleso.ua, вас чекає великий вибір шин вищого класу:',
    'Хочете придбати найкращу резину на літо, зиму та всесезонні умови? У нас на prokoleso.ua ви знайдете широкий вибір шин вищого класу:',
    'Шукаєте найкращу резину на літо, зиму та всесезонні умови? Заходьте на prokoleso.ua - у нас великий асортимент високоякісних шин:',
    'Плануєте купити найкращу резину на літо, зиму та всесезонні умови? Заходьте на prokoleso.ua, де вас чекає обширний вибір шин преміум-класу:',
    'У пошуках найкращої резини на літо, зиму та всесезонні умови? Відвідайте prokoleso.ua - у нас великий вибір високоякісних шин:',
    'Бажаєте купити найкращу гуму на Літо, Зиму та Всесезонні умови? Заходьте на prokoleso.ua, де представлений величезний вибір шин найвищого рівня якості:',
    'Вибираєте найкращу гуму на Літо, Зиму та Всесезонні умови? У нас вас чекає широкий асортимент шин преміум-класу на prokoleso.ua:',
    'Шукаєте оптимальну гуму на Літо, Зиму та Всесезонні умови? Загляньте на prokoleso.ua, де представлений великий вибір шин високої якості:',
    'Плануєте придбати гуму на Літо, Зиму та Всесезонні умови? У нас на prokoleso.ua ви знайдете різноманітний асортимент шин преміум-класу:',
    'У пошуках якісної гуми на Літо, Зиму та Всесезонні умови? Завітайте на prokoleso.ua - у нас великий вибір шин найвищого рівня якості:',
    'Бажаєте придбати якісну гуму на Літо, Зиму та Всесезонні умови? Заходьте на prokoleso.ua, де представлений широкий асортимент висококласних шин:',
    'Вас чекає найкраща гума для Літа, Зими та Всесезонних умов на prokoleso.ua. Пропонуємо широкий вибір шин високої якості:',
    'На prokoleso.ua вас очікує найкраща гума для Літа, Зими та Всесезонних умов. Різноманіття шин вищого класу в вашому розпорядженні:',
    'Найкраща гума для Літа, Зими та Всесезонних умов доступна на prokoleso.ua. У нас ви знайдете різноманітні шини високої якості:',
    'Загляньте на prokoleso.ua - тут вас чекає найкраща гума для Літа, Зими та Всесезонних умов. Ми пропонуємо широкий асортимент шин високої якості:',
    'Вас чекає найкраща гума для Літа, Зими та Всесезонних умов на prokoleso.ua. Пропонуємо широкий вибір шин вищого класу:',
    'Найкраща гума для Літа, Зими та Всесезонних умов уже чекає вас на prokoleso.ua. Ми пропонуємо різноманітні шини високої якості:',
    'Шукаєте найкращу гуму для Літа, Зими та Всесезонних умов? Завітайте на prokoleso.ua - у нас широкий вибір шин високої якості:',
    'У нас на prokoleso.ua ви знайдете найкращу гуму для Літа, Зими та Всесезонних умов. Ми пропонуємо різноманітні шини вищого класу:',
    'Вас чекає найкраща гума для Літа, Зими та Всесезонних умов на prokoleso.ua. Пропонуємо широкий вибір шин високої якості:',
    'Найкраща гума для Літа, Зими та Всесезонних умов доступна на prokoleso.ua. У нас ви знайдете різноманітні шини високої якості:',
    'Загляньте на prokoleso.ua - тут вас чекає найкраща гума для Літа, Зими та Всесезонних умов. Ми пропонуємо широкий асортимент шин високої якості:',
    'Вас чекає найкраща гума для Літа, Зими та Всесезонних умов на prokoleso.ua. Пропонуємо широкий вибір шин вищого класу:',
    'Найкраща гума для Літа, Зими та Всесезонних умов уже чекає вас на prokoleso.ua. Ми пропонуємо різноманітні шини високої якості:',
    'Шукаєте найкращу гуму для Літа, Зими та Всесезонних умов? Завітайте на prokoleso.ua - у нас широкий вибір шин високої якості:',
    "Вас чекає найкраща гума для Літа, Зими та Всесезонних умов на prokoleso.ua. Представлений широкий вибір шин високої якості:",
    "Найкраща гума для Літа, Зими та Всесезонних умов вже чекає вас на prokoleso.ua. Ми пропонуємо різноманіття шин високої якості:",
    "Шукаєте найкращу гуму для Літа, Зими та Всесезонних умов? Заходьте на prokoleso.ua - у нас широкий асортимент шин високої якості:",
    "У нас на prokoleso.ua ви знайдете найкращу гуму для Літа, Зими та Всесезонних умов. Ми пропонуємо різноманіття шин найвищої якості:",
    "Вас чекає найкраща гума для Літа, Зими та Всесезонних умов на prokoleso.ua. Представлений широкий асортимент шин найвищої якості:",
    "Найкраща гума для Літа, Зими та Всесезонних умов доступна на prokoleso.ua. Ми пропонуємо різноманіття шин вищого класу:",
    "Загляньте на prokoleso.ua - тут вас чекає найкраща гума для Літа, Зими та Всесезонних умов. Ми пропонуємо широкий вибір шин виняткової якості:",
    "Шукаєте найкращу гуму для Літа, Зими та Всесезонних умов? Заходьте на prokoleso.ua - у нас різноманіття шин вищого класу:",
    "У нас на prokoleso.ua вас чекає найкраща гума для Літа, Зими та Всесезонних умов. Ми пропонуємо різноманіття шин найвищого класу:",
    "Вас чекає найкраща гума для Літа, Зими та Всесезонних умов на prokoleso.ua. Представлений широкий асортимент шин виняткової якості:",
    "Найкраща гума для Літа, Зими та Всесезонних умов доступна на prokoleso.ua. У нас представлений широкий вибір шин вищого класу:",
    "Загляньте на prokoleso.ua - тут вас чекає найкраща гума для Літа, Зими та Всесезонних умов. Ми пропонуємо широкий вибір шин виняткової якості:",
    "Шукаєте найкращу гуму для Літа, Зими та Всесезонних умов? Заходьте на prokoleso.ua - у нас різноманіття шин вищого класу:",
    "У нас на prokoleso.ua вас чекає найкраща гума для Літа, Зими та Всесезонних умов. Ми пропонуємо різноманіття шин найвищого класу:",
    "Вас чекає найкраща гума для Літа, Зими та Всесезонних умов на prokoleso.ua. Представлений широкий асортимент шин виняткової якості:",
    "Найкраща гума для Літа, Зими та Всесезонних умов доступна на prokoleso.ua. Ми пропонуємо різноманіття шин вищого класу:",
    "Плануєте оновити гуму для свого автомобіля? У нас вас чекає найширший вибір шин преміум-класу:",
    "Шукаєте найкращу гуму для вашого автомобіля? У нас представлений найширший асортимент шин преміум-класу:",
    "Вас цікавить покупка найкращої гуми для вашого автомобіля? У нас вас чекає найрізноманітніший вибір шин преміум-класу:",
    "Бажаєте придбати найкращу гуму для свого автомобіля? Загляньте до нас - у нас найширший асортимент шин преміум-класу:",
    "Плануєте придбати найкращу гуму для свого автомобіля? У нас вас чекає найбільший вибір шин преміум-класу:",
    "Вас цікавить покупка найкращої гуми для вашого автомобіля? Загляньте до нас - у нас найширший асортимент шин преміум-класу:",
    "Бажаєте оновити гуму для свого автомобіля? У нас вас чекає найрізноманітніший вибір шин преміум-класу:",
    "Плануєте придбати найкращу гуму для вашого автомобіля? Загляньте до нас - у нас найширший асортимент шин преміум-класу:",
    "Вас цікавить покупка найкращої гуми для вашого автомобіля? У нас представлений найбільший вибір шин преміум-класу:",
    "Бажаєте придбати найкращу гуму для вашого автомобіля? Загляніть до нас - у нас найрізноманітніший вибір шин преміум-класу:",
    "Плануєте купити найкращу гуму для свого автомобіля? У нас представлений найширший асортимент шин преміум-класу:",
    "Вас цікавить покупка найкращої гуми для вашого автомобіля? Загляніть до нас - у нас найбільший вибір шин преміум-класу:",
    "Бажаєте оновити гуму для свого автомобіля? У нас представлений найширший асортимент шин преміум-класу:",
    "Плануєте придбати найкращу гуму для вашого автомобіля? Загляніть до нас - у нас найрізноманітніший вибір шин преміум-класу:",
    "Вас цікавить покупка найкращої гуми для свого автомобіля? У нас на вас чекає найширший асортимент шин преміум-класу:",
    "Бажаєте оновити гуму для свого автомобіля? Загляніть до нас - у нас найбільший вибір шин преміум-класу:",
    "Плануєте придбати найкращу гуму для вашого автомобіля? У нас представлений найширший асортимент шин преміум-класу:",
    "Вас цікавить покупка найкращої гуми для свого автомобіля? Загляніть до нас - у нас найрізноманітніший вибір шин преміум-класу:",
    "Бажаєте оновити гуму для свого автомобіля? У нас на вас чекає найширший асортимент шин преміум-класу:",
    "Плануєте купити найкращу гуму для вашого автомобіля? Загляніть до нас - у нас найбільший вибір шин преміум-класу:",
    "Вибирайте тільки найкращі шини на сайті ПРОКОЛЕСО. У нас ви можете замовити та купити якісну гуму:",
    "Тільки у нас на сайті ПРОКОЛЕСО представлені найкращі шини. Замовте та купуйте гуму прямо зараз:",
    "Найкращі шини чекають вас на сайті ПРОКОЛЕСО. Замовте та купуйте гуму легко та швидко:",
    "Купуйте тільки найкращі шини на сайті ПРОКОЛЕСО. У нас ви знайдете гуму високої якості:",
    "Тільки у нас на сайті ПРОКОЛЕСО представлені шини найвищої якості. Замовте та купуйте гуму без зайвих клопотів:",
    "Найкращі шини доступні на сайті ПРОКОЛЕСО. Замовте та купуйте гуму для вашого автомобіля зараз:",
    "Купуйте якісну гуму на сайті ПРОКОЛЕСО. У нас тільки найкращі шини для вашого автомобіля:",
    "Тільки у нас на сайті ПРОКОЛЕСО ви знайдете найкращі шини. Замовте та купуйте гуму з доставкою до дому:",
    "Найкращі шини для вашого автомобіля доступні на сайті ПРОКОЛЕСО. Замовте та купуйте гуму онлайн:",
    "Купуйте тільки найкращі шини на сайті ПРОКОЛЕСО. У нас ви знайдете широкий вибір якісної гуми:",
    "Тільки у нас на сайті ПРОКОЛЕСО представлені шини найвищого класу. Замовте та купуйте гуму прямо зараз:",
    "Найкращі шини чекають вас на сайті ПРОКОЛЕСО. Купуйте гуму безпечно та зручно:",
    "Купуйте якісну гуму на сайті ПРОКОЛЕСО. У нас тільки найкращі шини для вашого автомобіля:",
    "Тільки у нас на сайті ПРОКОЛЕСО ви знайдете найкращі шини. Замовте та купуйте гуму з доставкою до дому:",
    "Найкращі шини для вашого автомобіля доступні на сайті ПРОКОЛЕСО. Замовте та купуйте гуму онлайн:",
    "Покупайте тільки кращі шини на сайті ПРОКОЛЕСО. У нас ви знайдете широкий вибір якісної гуми:",
    "Тільки у нас на сайті ПРОКОЛЕСО представлені шини найвищої якості. Замовте та купуйте гуму прямо зараз:",
    "Найкращі шини чекають вас на сайті ПРОКОЛЕСО. Покупайте гуму безпечно та зручно:",
    "Покупайте якісну гуму на сайті ПРОКОЛЕСО. У нас тільки кращі шини для вашого автомобіля:",
    "Тільки у нас на сайті ПРОКОЛЕСО ви знайдете кращі шини. Замовте та купуйте гуму з доставкою до дому:",
    "У нас ви можете замовити та купити колеса прямо зараз:",
    "Замовте та купіть колеса у нас:",
    "Колеса доступні для замовлення та покупки прямо тут:",
    "Ви можете придбати колеса у нас:",
    "У нас є можливість замовлення та покупки коліс:",
    "Придбайте колеса у нас:",
    "Замовляйте та купуйте колеса у нас:",
    "У нас ви знайдете колеса для замовлення та покупки:",
    "Тут можна замовити та купити колеса:",
    "У нас є широкий вибір коліс для замовлення та покупки:",
    "Покупайте колеса прямо тут:",
    "Вибирайте та купуйте колеса у нас:",
    "Замовлення колес доступне у нас:",
    "Покупка колес доступна у нас:",
    "У нас можна замовити та купити колеса:",
    "Колеса чекають вас для замовлення та покупки:",
    "Ви можете придбати колеса у нас:",
    "Замовте та купіть колеса прямо тут:",
    "У нас є можливість замовлення та покупки коліс:",
    "Придбайте колеса у нас:",
    "Замовляйте та купуйте шини на літо або зиму на сайті ПРОКОЛЕСО:",
    "У нас на сайті ПРОКОЛЕСО ви можете замовити та придбати шини на літо або зиму:",
    "На сайті ПРОКОЛЕСО доступні для замовлення та покупки шини на літо або зиму:",
    "Шини на літо або зиму можна замовити та придбати на сайті ПРОКОЛЕСО:",
    "Вибирайте та придбавайте шини на літо або зиму на сайті ПРОКОЛЕСО:",
    "Замовте та купіть шини на літо або зиму легко і швидко на сайті ПРОКОЛЕСО:",
    "На сайті ПРОКОЛЕСО ви знайдете широкий вибір шин на літо або зиму для замовлення та покупки:",
    "Замовлення та покупка шин на літо або зиму доступні на сайті ПРОКОЛЕСО:",
    "Придбайте шини на літо або зиму на сайті ПРОКОЛЕСО:",
    "Шини на літо або зиму чекають вас для замовлення та покупки на сайті ПРОКОЛЕСО:",
    "Замовте та купіть шини на літо або зиму на сайті ПРОКОЛЕСО:",
    "На сайті ПРОКОЛЕСО можна замовити та придбати шини на літо або зиму:",
    "Шини на літо або зиму доступні для замовлення та покупки на сайті ПРОКОЛЕСО:",
    "Покупка шин на літо або зиму можлива на сайті ПРОКОЛЕСО:",
    "Замовлення та покупка шин на літо або зиму легкі та зручні на сайті ПРОКОЛЕСО:",
    "Виберіть та придбайте шини на літо або зиму на сайті ПРОКОЛЕСО:",
    "Замовте та купіть шини на літо або зиму прямо зараз на сайті ПРОКОЛЕСО:",
    "Шини на літо або зиму доступні для замовлення та покупки на сайті ПРОКОЛЕСО:",
    "Покупка шин на літо або зиму легко доступна на сайті ПРОКОЛЕСО:",
    "Придбавайте шини на літо або зиму на сайті ПРОКОЛЕСО:",
    "У нас на сайті ПРОКОЛЕСО шини на літо або зиму можна замовити та купити:",
    "Замовте та купіть шини на літо або зиму на сайті ПРОКОЛЕСО вже сьогодні:",
    "На сайті ПРОКОЛЕСО ви знайдете широкий асортимент шин на літо або зиму для замовлення та покупки:",
    "Шини на літо або зиму доступні для замовлення та покупки на сайті ПРОКОЛЕСО:",
    "Придбавайте шини на літо або зиму на сайті ПРОКОЛЕСО:",
    "Виберіть та замовте шини на літо або зиму на сайті ПРОКОЛЕСО:",
    "Замовте та отримайте шини на літо або зиму у нас на сайті ПРОКОЛЕСО:",
    "Шини на літо або зиму очікують вас для замовлення та покупки на сайті ПРОКОЛЕСО:",
    "Замовте та купіть шини на літо або зиму на сайті ПРОКОЛЕСО зараз:",
    "На сайті ПРОКОЛЕСО можна легко замовити та купити шини на літо або зиму:",
    "Придбайте шини на літо або зиму без зайвих зусиль на сайті ПРОКОЛЕСО:",
    "У нас на сайті ПРОКОЛЕСО широкий вибір шин на літо або зиму для замовлення та покупки:",
    "Замовлення та покупка шин на літо або зиму на сайті ПРОКОЛЕСО проходять швидко та зручно:",
    "Покупка шин на літо або зиму у нас на сайті ПРОКОЛЕСО - це просто та зручно:",
    "Замовте та купіть шини на літо або зиму з доставкою на сайті ПРОКОЛЕСО:",
    "Виберіть та замовте шини на літо або зиму прямо зараз на сайті ПРОКОЛЕСО:",
    "Придбавайте шини на літо або зиму з гарантією якості на сайті ПРОКОЛЕСО:",
    "Замовте шини на літо або зиму та отримайте швидку доставку від ПРОКОЛЕСО:",
    "У нас на сайті ПРОКОЛЕСО найширший вибір шин на літо або зиму:",
    "Покупка шин на літо або зиму на сайті ПРОКОЛЕСО - це надійно та зручно:",
    "Замовляйте шини на літо або зиму та заощаджуйте час на сайті ПРОКОЛЕСО:",
    "Виберіть якісні шини на літо або зиму за вигідною ціною на сайті ПРОКОЛЕСО:",
    "У нас на сайті ПРОКОЛЕСО найширший вибір шин на літо або зиму:",
    "Покупка шин на літо або зиму на сайті ПРОКОЛЕСО - це надійно і зручно:",
    "Замовляйте шини на літо або зиму і економте час на сайті ПРОКОЛЕСО:",
    "Вибирайте якісні шини на літо або зиму за вигідною ціною на сайті ПРОКОЛЕСО:",
    "Покупайте шини на літо або зиму з упевненістю в їх надійності на сайті ПРОКОЛЕСО:",
    "Замовте шини на літо або зиму і насолоджуйтеся комфортною поїздкою з ПРОКОЛЕСО:",
    "Придбавайте шини на літо або зиму без зайвих клопотів на сайті ПРОКОЛЕСО:",
    "У нас на сайті ПРОКОЛЕСО ви знайдете шини на літо або зиму для будь-яких потреб:",
    "Замовте якісні шини на літо або зиму і насолоджуйтеся комфортною їздою з ПРОКОЛЕСО:",
    "Вибирайте шини на літо або зиму з найкращих брендів на сайті ПРОКОЛЕСО:",
    "Придбайте шини на літо або зиму з упевненістю в їх продуктивності на сайті ПРОКОЛЕСО:",
    "Замовте шини на літо або зиму і отримайте відмінну якість на сайті ПРОКОЛЕСО:",
    "Покупайте шини на літо або зиму з гарантією якості та надійності на сайті ПРОКОЛЕСО:",
    "Замовте шини на літо або зиму і насолоджуйтесь безпечною їздою з ПРОКОЛЕСО:",
    "Виберіть шини на літо або зиму, що відповідають вашим потребам, на сайті ПРОКОЛЕСО:",
    "Придбавайте шини на літо або зиму з високими показниками безпеки на сайті ПРОКОЛЕСО:",
    "Замовте шини на літо або зиму і отримайте їх швидко та зручно на сайті ПРОКОЛЕСО:",
    "Покупайте шини на літо або зиму і насолоджуйтеся високим рівнем комфорту в поїздках з ПРОКОЛЕСО:",
    "Вас чекають шини на літо або зиму на prokoleso.ua:",
    "У нас на prokoleso.ua ви знайдете шини на літо або зиму:",
    "На prokoleso.ua доступні шини для літа і зими:",
    "Покупайте шини на літо або зиму на prokoleso.ua:",
    "В prokoleso.ua шини на літо або зиму вже в наявності:",
    "Вибирайте шини на літо або зиму на prokoleso.ua:",
    "Замовте шини для літа або зими на prokoleso.ua:",
    "Придбавайте шини на літо або зиму на prokoleso.ua:",
    "Ваш вибір — шини на літо або зиму на prokoleso.ua:",
    "У нас в асортименті шини для літа і зими на prokoleso.ua:",
    "На prokoleso.ua представлені шини на літо або зиму:",
    "Шини на літо або зиму доступні для замовлення на prokoleso.ua:",
    "Покупайте шини на літо або зиму прямо зараз на prokoleso.ua:",
    "На prokoleso.ua ви знайдете шини, підходящі для літа і зими:",
    "Замовляйте шини на літо або зиму на prokoleso.ua вже сьогодні:",
    "Шини на літо або зиму чекають вас на prokoleso.ua:",
    "На prokoleso.ua представлений широкий вибір шин для літа і зими:",
    "Шини на літо або зиму представлені на prokoleso.ua:",
    "Вас чекають шини, які можна замовити і купити на літо або зиму, на prokoleso.ua:",
    "Придбавайте шини на літо або зиму у нас на prokoleso.ua:",
    "Зануртеся в світ шин на літо або зиму з нашим асортиментом на prokoleso.ua:",
    "Ваш автомобіль заслуговує найкращих шин на літо або зиму, які ви знайдете на prokoleso.ua:",
    "Відкрийте для себе різноманіття моделей шин для літа і зими на prokoleso.ua:",
    "Плануйте свої поїздки безпечно і впевнено, вибравши шини на літо або зиму з нашого каталогу на prokoleso.ua:",
    "Надаємо вам можливість вибору з широкого асортименту шин на літо або зиму на prokoleso.ua:",
    "На prokoleso.ua ви знайдете не просто шини на літо або зиму, а джерело впевненості на дорозі:",
    "Підготуйте свій автомобіль до різних умов з шинами на літо або зиму, доступними на prokoleso.ua:",
    "На prokoleso.ua ви зможете підібрати ідеальні шини на літо або зиму, відповідні вашим вимогам:",
    "Ваш вибір — наші шини на літо або зиму, що гарантують комфорт і безпеку, доступні на prokoleso.ua:",
    "Купуйте шини на літо або зиму з впевненістю, базуючись на широкому асортименті на prokoleso.ua:",
    "На prokoleso.ua ви знайдете шини на літо або зиму, які будуть ідеальним поєднанням ціни та якості:",
    "Оснащуйте свій автомобіль шинами на літо або зиму, представленими на prokoleso.ua, і насолоджуйтеся комфортною їздою:",
    "На prokoleso.ua представлені шини на літо або зиму різних брендів та моделей для задоволення будь-яких потреб:",
    "Зробіть правильний вибір на користь шин на літо або зиму, доступних у нашому інтернет-магазині prokoleso.ua:",
    "Підберіть оптимальні шини на літо або зиму для вашого автомобіля з нашого каталогу на prokoleso.ua:",
    "Ваша безпека і комфорт на дорозі - наш пріоритет з шинами на літо або зиму від prokoleso.ua:",
    "На prokoleso.ua ви знайдете широкий вибір шин на літо або зиму, що відповідає вашим вимогам та бюджету:",
    "Подорожуйте безпечно та впевнено з шинами на літо або зиму, доступними для замовлення на prokoleso.ua:",
    "Оберіть ідеальні шини на літо або зиму з нашого асортименту на prokoleso.ua та оцініть їх якість та надійність:",
    "На prokoleso.ua ви знайдете шини на літо або зиму, які забезпечать вам спокій та безпеку на дорозі:",

  ]


  # ========================================================
  # конец блока константы
  # ========================================================

  def adjust_keyword_stuffing(str)
    current_stuffing = keyword_stuffing_for_all_words(str)
    adjustments = {}

    # Количество слов в тексте
    total_words = remove_html_tags(str).split.length

    KEYWORD_STUFFING_TEMPLATE.each do |keyword, desired_stuffing|
      # Текущая "тошнотность" для этого слова
      current_stuffing_level = current_stuffing[keyword] || 0

      # Рассчёт реального количества слов в тексте и желаемого количества слов
      current_word_count = (total_words * current_stuffing_level / 100).round
      target_word_count = (total_words * desired_stuffing['keyword_stuffing'] / 100).round
      adjustments[keyword] = {
        current_word_count: current_word_count,
        target_word_count: target_word_count,
        action: (target_word_count - current_word_count)
      }
    end

    adjustments
  end

  # Тошнота по Адвего: 30-40% - Учитывает не только количество повторений слов, но и их морфологические формы
  def keyword_stuffing_for_all_words(str)
    str = remove_html_tags(str)
    str = str.gsub("\n", ' ') # Add this line to replace new lines with spaces

    total_words = str.split.length

    results = {}
    WORD_FORMS.each do |word, forms|
      occurrences = forms.sum { |form| word_occurrences(str, form) }
      results[word] = (occurrences / total_words.to_f * 100).round(2)
    end
    results
  end

  def keyword_count_for_all_words(str)
    results = {}
    WORD_FORMS.each do |word, forms|
      occurrences = forms.sum { |form| word_occurrences(str, form) }
      results[word] = occurrences
    end
    results
  end

  def chars_count(str)
    str_test = remove_html_tags(str)
    str_test.scan(/[\p{L}\p{N}]/).length
  end

  def remove_html_tags(str)
    str.gsub(/<\/?[^>]*>/, "")
  end

  def word_occurrences(str, word)
    str.scan(/#{word}/i).length
  end

  # Рекомендуемый уровень тошнотности:
  # Классическая тошнота: 2,7-7% -  отношение количества повторений ключевого слова к общему количеству слов в тексте.
  def keyword_stuffing(str, word)
    total_words = remove_html_tags(str).split.length
    result = word_occurrences(str, word) / total_words.to_f * 100
    result = "Классическая тошнота: #{result.round(2)}%"
  end

  def replace_trash(str)
    str_new = str.gsub(/Dover's Auto Care/, 'PROKOLESO')
    str_new.gsub(/а боковой стене шин/, 'а боковине шин')
    str_new.gsub(/Doudlestar/, 'Doublestar')

    str_new
  end


  def add_new_el_to_hash(max_replacements, selected_max_elements)
    if max_replacements["шина"][:action] > 0 && max_replacements["резина"][:action] > 0
      min_value = [max_replacements["шина"][:action], max_replacements["резина"][:action]].min
      selected_max_elements["резина и шины"] = {}
      selected_max_elements["резина и шины"][:action] = min_value
    end
    selected_max_elements
  end

  def replace_text_by_hash(text)
    hash = KEYWORD_STUFFING_TEMPLATE
    sentences = text.split(/\.|!|\?|\\n/)
    count = Hash.new(0)


    max_replacements = adjust_keyword_stuffing(text)
    selected_max_elements = max_replacements.select { |key, value| value[:action] > 0 }
    selected_max_elements = add_new_el_to_hash(max_replacements, selected_max_elements)
    grup = false

    sentences.map! do |sentence|
      hash.each do |key, replacement|

        if selected_max_elements[key] && selected_max_elements[key][:action] > 0
          was_replaced = false
          replacement['replaces'].each do |k, rpl|
            next if grup == true && replacement['grup'] == 'tyres'
            sentence = sentence.sub(k) do |match|
              count[key] += 1

              if count[key] >= selected_max_elements[key][:action]
                match
              else
                grup = true if replacement['grup'] == 'tyres'
                was_replaced = true
                if key == "резина и шины"
                  count["резина"] += 1
                  count["шина"] += 1
                end
                rpl.is_a?(Array) ? rpl.sample : rpl
              end
            end
            break if was_replaced
          end
        end
      end
      grup = false
      sentence
    end

    sentences.join('.')
  end



  def replace_text_by_hash_minus(text)
    # метод возвращает текст с заменами, заданными в KEYWORD_STUFFING_TEMPLATE, с учетом лимитов и регуляций,
    # установленных функцией adjust_keyword_stuffing.

    hash = KEYWORD_STUFFING_TEMPLATE
    sentences = text.split(/\.|!|\?|\\n/)
    count = Hash.new(0)

    max_replacements = adjust_keyword_stuffing(text)
    selected_max_elements = max_replacements.select { |key, value| value[:action] < 0 }

    sentences.map! do |sentence|
      hash.each do |key, replacement|
        if selected_max_elements[key] && selected_max_elements[key][:action] < 0
          was_replaced = false
          replacement['sinonims'].each do |k, rpl|
            # next if grup == true && replacement['grup'] == 'tyres'
            sentence = sentence.sub(k) do |match|
              count[key] -= 1

              if count[key] <= selected_max_elements[key][:action]
                match
              else
                was_replaced = true
                rpl.is_a?(Array) ? rpl.sample : rpl
              end
            end
            break if was_replaced
          end
        end
      end
      sentence
    end

    sentences.join('.')
  end

  def prepositions_conjunctions
    # Весь список предлогов, союзов русского языка и служебных слов
    Set.new %w[http https prokoleso h1 h2 h3 h4 h5 h6 li ul ol p br а без благодаря близ в вблизи ввиду вглубь вдобавок вдоль взамен включая вкруг вместо вне внизу внутри внутрь во вовнутрь вокруг вопреки вперед впереди вплоть вразрез вроде вслед вследствие встречу втечение для до за из из-за из-под изнутри изо к как касательно кроме кругом между мимо на над надо наперекор наподобие напротив насчет насчёт несмотря ниже о об обо обок около от относительно ото перед пред предо прежде при применительно к про ради с среди средь у чрез через со под над после по без от до при то потому аль а будто как бы не если благо буде будто ведь выну да да дабы да что до тех пор пока ежели едва ежели едва ежелибо если бы еслить есмь затем что зато зачем и ибо идеже как как бы как будто как бы не когда коль коль скоро как какой бы ни лишь бы только на что не пусть чтобы нежели нежли не затем ли неужели ни но однако оттого отчего пока почему потому что притом притому причем промежду тем просто пусть раз разве как так тогда то есть точно тоже хоть хотя]
  end



  def standardization_of_punctuation(text)

    text = text.gsub(/(,|\:)\s*,/, ",") # двойные запятые
    text = text.gsub(/ \/ /, "") # убрать одиночные слеши
    text = text.gsub(/\.\s*,/, ".") # точка-пробелы-запятая
    text = text.gsub(/^[.!?]+/, '')  # Удалить лишние знаки препинания c начала строки
    text = text.gsub(/((\.|,|\:)\s*\.)+/, ".") # двойные точки или запятая-пробелы-точка
    text = text.gsub(/\s+/, ' ')
    text

  end


  def similar_sentences(text)
    # результат хеш с проверкой предложений на похожесть
    text = text.gsub(/(>|\u003e)\s*(\u003c|<)/, '><')
    sentences = text.split(/\.|!|\?|\\n|(<\/h\d>)/)

    number_rubric = 0
    number_str_of_rubric = 0
    # Создаем массив 'sentence_elements', где каждый элемент - это хэш с предложением и его массивом уникальных слов
    sentence_elements = sentences.map do |sentence|
      # puts sentence
      # Создаем временную копию предложения с заменой знаков препинания на пробелы
      txt = sentence.gsub(/[,;:'"(){}\[\]<>\/]/, ' ')
      if sentence =~ /\/h\d/
        number_rubric += 1
        number_str_of_rubric = 0
      else
        number_str_of_rubric += 1
      end

      # Очистить каждое слово от знаков препинания, привести его к нижнему регистру и проверить, что остаток содержит больше одного символа
      words = txt.split(' ').map do |word|
        word_without_last_two = word.strip[0...-2].downcase
        word_without_last_two unless prepositions_conjunctions.include?(word_without_last_two) or word_without_last_two.length <= 2
      end.uniq
      { sentence: sentence, words: words.compact, number_rubric: number_rubric, number_str_of_rubric: number_str_of_rubric }
    end

    # Для каждого элемента в sentence_elements, сравниваем его с остальными элементами
    comparisons = []
    sentence_elements.each_with_index do |element1, i|
      (i + 1...sentence_elements.length).each do |j|
        element2 = sentence_elements[j]
        common_words = element1[:words] & element2[:words]
        comparisons << { sentence_1: [element1[:sentence], element1[:number_rubric], element1[:number_str_of_rubric]],
                         sentence_2: [element2[:sentence], element2[:number_rubric], element2[:number_str_of_rubric]],
                         common_words: common_words }
      end
    end

    # Возвращаем все сравнения
    comparisons
  end

  def rating_sentence(arr_sentence)
    rating = 0
    str = arr_sentence[0]
    # number_rubric = arr_sentence[1]
    number_str_of_rubric = arr_sentence[2]

    if number_str_of_rubric <= 2
      rating = -5
    else
      # № предложения ближе к концу абзаца
      rating += 1 if number_str_of_rubric > 2
      # в предложении содержится размер, понижаем рейтинг
      rating += ((str =~ SEARCH_SIZE_1) || (str =~ SEARCH_SIZE_2)) ? -1 : 0
      # при равном рейтинге удаляем большее по символам
      rating += str.size/100
    end
    rating
  end


  def similar_sentences_delete(text)
    # удаление предложения с большим рейтингом
    hash = similar_sentences(text)
    hash.each do |el|
      str = rating_sentence(el[:sentence_2])< rating_sentence(el[:sentence_1]) ? el[:sentence_1][0]: el[:sentence_2][0]
      if el[:common_words].size >= 4 && text =~ /#{str}/
        text = text.sub(str, '')
        # puts "el = #{el.inspect}"
        # puts " = = ==  = = #{str}"
      end
    end
    text
  end





end
