{
  "Block_1": {
    "order_out": "0",
    "TextType": "ассортимент",
    "TextTypeTag": "0",
    "TextTitle": "ЛУЧШИЕ ШИНЫ 195/65R15 ОТ официального представителя ИЗВЕСТНЫХ брендов",
    "TextBody": [
      "На сайте PROKOLESO (Украина) представлен большой ассортимент радиальной резины 195/65R15 для колес европейских авто, шины купить  можно с выгодным соотношением 'цена - качество' в любой день недели.",
      "Интернет-магазин PROKOLESO является официальным дилером резины торговых марок Bridgestone, Firestone, Doublestar. Мы дорожим своей репутацией и предоставляем многочисленным клиентам возможность купить оригинальные сертифицированные автомобильные шины 195/65R15 по доступной стоимости с гарантией от производителя.",
      "В электронном каталоге нашего интернет-магазина разработана удобная система навигации, позволяющая легко отфильтровать шины 195/65R15 для конкретной транспортного средства.  Мы поможем оформить заказ на доставку купленных  у нас шин автоперевозчиком Новая Почта по месту назначения."
    ]
  },
  "Block_2": {
    "order_out": "0",
    "TextType": "ассортимент",
    "TextTypeTag": "0",
    "TextTitle": "Купить ЛУЧШИЕ ШИНЫ 195/65R15 официального представителя ИЗВЕСТНЫХ брендов",
    "TextBody": [
      "Покупка резины 195/65R15 открывает множество возможностей благодаря разнообразию производителей и ассортименту. Для тех, кто ценит качество, доступны модели от таких гигантов, как Michelin, Bridgestone, Pirelli и Continental. Они отличаются не только базовыми характеристиками, но и уникальными особенностями, такими как оригинальные дизайны протектора, повышенная износостойкость и инновационный состав резины.",
      "Для бюджетного водителя выбор шин 195/65R15 также обширен. У нас в наличии множество моделей летних и зимних шин по самым доступным ценам. Среди них изделия от таких производителей, как Doublestar, Sailun, Росава, Premiorri и другие, которые пользуются доверием автолюбителей не только в Киеве, но и в других регионах, в любое время года (летом и зимой).",
      "Важно помнить, что длительный срок службы шин 195/65R15 зависит от правильной эксплуатации. Избегайте резких стартов, экстренных торможений и других экстремальных ситуаций на дороге, следите за правильным давлением в шинах и условиями их хранения. Правильное решение - Купить шины 195/65R15 в Украине на ПРОКОЛЕСО, где предлагается сертифицированная продукция с гарантированным качеством."
    ]
  }
}