# app/services/dictionaries/const_reviews_gender_female.rb

FEMALE_NAMES = {
  names_ua: [
    "Анна", "Анастасія", "Вікторія", "Ольга", "Марія", "Катерина", "Наталія", "Юлія",  "Ірина",
    "Єлизавета", "Тетяна", "Софія", "Аліна", "Ксенія", "Марина", "Людмила", "Вероніка", "Олена", "Аліса",
    "Ева", "Марта", "Ярослава", "Сніжана", "Світлана", "Поліна", "Ліза",
    "Мілана", "Ілона", "Валерія", "Діана", "Богдана", "Аміна", "Надія",
    "Зоряна", "Аліна", "Валентина", "Софія", "Влада", "Іванна", "Олександра", "Ганна",
    "Лідія", "Уляна", "Таїсія", "Оксана", "Яна", "Майя", "Каріна", "Маргарита", "Леся", "Інна", "Альона", "Віра", "Ніка", "Олеся", "Лілія", "Василина", "Галина",
    "Антоніна", "Мирослава", "Ірина", "Віталія", "Кіра", "Аріна", "Стефанія",
    "Наталя", "Дар'я", "Олександра", "Агата", "Ізабелла", "Влада",
    "Аліса", "Нонна", "Зоя", "Лариса", "Фаїна", "Валерія", "Юлія"
  ],
  diminutive_names_ua: [
    "Аня", "Настя", "Віка", "Оля", "Катя", "Наташа", "Юля", "Даша", "Іра",
    "Ліза", "Таня", "Софійка", "Аліна", "Ксюша", "Маринка", "Люда", "Віка",  "Аліса",
    "Єва", "Марта", "Яся", "Сніжана", "Свєта", "Даша", "Поліна", "Емма", "Ліза",
    "Міла", "Ілона", "Лєра", "Діана", "Богданка", "Соля", "Аміна", "Міра", "Рокса", "Надя",
    "Зоряна", "Алінка", "Валя", "Соня", "Влада", "Іванка", "Саша", "Анечка",
    "Ліда", "Уляна", "Тася", "Оксана", "Яна", "Майя", "Каріна", "Рита", "Леся", "Еля",
    "Інна", "Орися", "Альона", "Віра", "Ніка", "Олеся", "Ліля",
    "Тоня", "Ірина", "Віталія",  "Кіра", "Арина",
    "Наташа", "Даша", "Саша",  "Клава",  "Влада",
    "Лариса",  "Юля"
  ],
  names_ru: [
    "Анна", "Анастасия", "Виктория", "Ольга", "Мария", "Екатерина", "Наталья", "Юлия",  "Ирина",
    "Елизавета", "Татьяна", "София", "Алина", "Ксения", "Марина", "Вероника", "Елена", "Алиса",
    "Ева", "Марта", "Снежана", "Светлана", "Полина", "Лиза",
    "Милана", "Диана", "Надежда", "Влада", "Александра",
    "Оксана", "Яна", "Карина", "Маргарита",
    "Инна", "Алена", "Вера", "Ника", "Олеся",
    "Кира", "Агата"
  ],
  diminutive_names_ru: [
    "Аня", "Настя", "Вика", "Оля", "Маша", "Катя", "Наташа", "Юля", "Даша", "Ира",
    "Лиза", "Таня", "Соня", "Алина", "Ксюша", "Марина", "Лена", "Алиса",
    "Ева", "Марта", "Снежана", "Света", 
    "Лера", "Диана", "Надя",
    "Влада", "Саша", "Регина",
    "Оксана", "Яна", "Карина", "Рита",
    "Инна", "Алена", "Вера", "Ника", "Олеся",
    "Кира", "Арина", "Агата"
  ],

  names_en: [
    "Anna", "Anastasia", "Victoria", "Olga", "Maria", "Ekaterina", "Natalia", "Julia", "Daria", "Irina",
    "Elizabeth", "Tatiana", "Sophia", "Alina", "Ksenia", "Marina", "Lyudmila", "Veronika", "Elena", "Alice",
    "Zlata", "Eva", "Marta", "Yaroslava", "Snezhana", "Svetlana", "Dariya", "Polina", "Emilia", "Liza",
    "Milana", "Ilona", "Valeria", "Diana",  
    "Zoryana", "Alina", "Valentina", "Sophia",  "Vlada", "Ivanna", "Alexandra", "Anna", "Regina",
    "Lidia", "Ulyana", "Taisia", "Oksana", "Yana", "Maya", "Karina", "Margarita", "Lesya", "Elina",
    "Adelina", "Inna", "Lilia", "Vasylina", "Galina",
    "Antonina", "Irina", "Vitalia", "Sabina", "Lyubov", "Emilia", "Kira", "Arina", "Stefania",
    "Natalia", "Darya", "Alexandra",  "Vlada", 
    "Amina", "Alice", "Melania"
  ],
  diminutive_names_en: [
    "Anna", "Nastya", "Vika", "Olya", "Masha", "Katya", "Natasha", "Julia", "Dasha", "Ira",
    "Lisa", "Tanya", "Sophie", "Alina", "Ksyusha", "Marina", "Lyuda", "Veronica", "Lena", "Alice",
    "Zlata", "Eva", "Martha", "Yasya", "Snizhana", "Sveta", "Dasha", "Polly", "Emma", "Lisa",
    "Mila", "Ilona", "Lera", "Diana", "Bogdana", "Nadia",
    "Zoriana", "Alinka", "Valya", "Sonya",  "Vlada", "Ivanna", 
    "Lydia", "Ully", "Tasya", "Oksana", "Yana", "Maya", "Karina", "Rita", "Lesya", "Ella",
    "Adelina", "Inna", "Orisia", "Alena", "Vera", "Nika", "Olesya", "Lily", "Vasya", "Galya",
    "Tonya", "Irina",  "Emma", "Kira", "Arina", "Steffa",
    "Natasha", "Dasha",  "Vlada"
  ]

}

FEMALE_PATRNYMICS = {
  patronymics_ua: [
    "Олександрівна", "Андріївна", "Дмитрівна", "Сергіївна", "Володимирівна", "Олегівна", "Іванівна", "Юріївна", "Миколаївна", "Михайлівна",
    "Віталіївна", "Богданівна", "Максимівна", "Романівна", "Петрівна", "Артемівна", "Ігорівна", "Євгенівна", "Антонівна", "Павлівна",
    "Тарасівна", "Василівна", "Григорівна", "Олексіївна", "Леонідівна", "Арсеніївна", "Анатоліївна", "Вадимівна", "Кирилівна", "Ростиславівна",
    "Валеріївна", "Данилівна", "Леонівна", "Альбертівна", "Марківна", "Борисівна", "Георгіївна", "Денисівна", "Святославівна",
    "Ярославівна", "Степанівна", "Валентинівна", "Мирославівна", "Адамівна", "Єгорівна", "Іллівна", "Матвіївна", "Юліанівна", "Бориславівна",
    "Захарівна", "Тимофіївна", "Федорівна", "Янівна", "Давидівна", "Єлисєївна", "Артурівна", "Остапівна", "Ізяславівна", "Семенівна",
    "Микитівна", "Львівна", "Вікторівна", "Даниїлівна", "Дамірівна", "Глібівна", "Любомирівна", "Русланівна", "Тимурівна", "Германівна",
    "Богданівна", "Аркадіївна", "Миронівна", "Володиславівна", "Едуардівна", "Адріанівна",  "Родіонівна", "Назарівна", "Євгеніївна"
  ],
  patronymics_ru: [
    "Александровна", "Андреевна", "Дмитриевна", "Сергеевна", "Владимировна", "Олеговна", "Ивановна", "Юрьевна", "Николаевна", "Михайловна",
    "Витальевна", "Богдановна", "Максимовна", "Романовна", "Петровна", "Артемовна", "Игоревна", "Евгеньевна", "Антоновна", "Павловна",
    "Тарасовна", "Васильевна", "Григорьевна", "Алексеевна", "Леонидовна", "Арсеньевна", "Анатольевна", "Вадимовна", "Кирилловна", "Ростиславовна",
    "Валерьевна", "Даниловна", "Леоновна", "Альбертовна", "Марковна", "Борисовна", "Георгиевна", "Денисовна", "Святославовна",
    "Ярославовна", "Степановна", "Валентиновна", "Мирославовна", "Адамовна", "Егоровна", "Ильинична", "Матвеевна", "Юлиановна", "Бориславовна",
    "Захаровна", "Тимофеевна", "Федоровна", "Яновна", "Давидовна", "Елисеевна", "Артуровна", "Остаповна", "Изяславовна", "Семёновна",
    "Никитовна", "Львовна", "Викторовна", "Данииловна", "Дамировна", "Глебовна", "Любомировна", "Руслановна", "Тимуровна", "Германовна",
    "Богдановна", "Аркадьевна", "Мироновна", "Владиславовна", "Эдуардовна", "Евгеньевна", "Эрнестовна"
  ]

}


