SIZES = ["195/65R15", ""]
BRANDS = ["GreenTire", ""]
MODELS = ["SuperDefender", ""]
AUTO = ["JLT", ""]
GENDERS = ["мужчина", "женщина"]
SEASONS = ["летние", "зимние", "всесезонные"]
TYPES_REVIEW = ["положительный", "негативный", "нейтральный"]
PROPERTIES_TIRES = ["Управляемость на сухом асфальте",
                    "Управляемость на мокром асфальте",
                    "Шумность",
                    "Цена/Качество",
                    "Управляемость на снегу",
                    "Управляемость на льду"]

COMBINATIONS_WINTER = {
  :positive => [[1, 1, 1, 1, 1, 1], [1, 1, 1, 1, 1, -1], [1, 1, 1, 1, 1, 0], [1, 1, 1, 1, -1, 1], [1, 1, 1, 1, -1, -1], [1, 1, 1, 1, -1, 0], [1, 1, 1, 1, 0, 1], [1, 1, 1, 1, 0, -1], [1, 1, 1, 1, 0, 0], [1, 1, 1, -1, 1, 1], [1, 1, 1, -1, 1, -1], [1, 1, 1, -1, 1, 0], [1, 1, 1, -1, -1, 1], [1, 1, 1, -1, -1, 0], [1, 1, 1, -1, 0, 1], [1, 1, 1, -1, 0, -1], [1, 1, 1, -1, 0, 0], [1, 1, 1, 0, 1, 1], [1, 1, 1, 0, 1, -1], [1, 1, 1, 0, 1, 0], [1, 1, 1, 0, -1, 1], [1, 1, 1, 0, -1, -1], [1, 1, 1, 0, -1, 0], [1, 1, 1, 0, 0, 1], [1, 1, 1, 0, 0, -1], [1, 1, 1, 0, 0, 0], [1, 1, -1, 1, 1, 1], [1, 1, -1, 1, 1, -1], [1, 1, -1, 1, 1, 0], [1, 1, -1, 1, -1, 1], [1, 1, -1, 1, -1, 0], [1, 1, -1, 1, 0, 1], [1, 1, -1, 1, 0, -1], [1, 1, -1, 1, 0, 0], [1, 1, -1, -1, 1, 1], [1, 1, -1, -1, 1, 0], [1, 1, -1, -1, 0, 1], [1, 1, -1, 0, 1, 1], [1, 1, -1, 0, 1, -1], [1, 1, -1, 0, 1, 0], [1, 1, -1, 0, -1, 1], [1, 1, -1, 0, 0, 1], [1, 1, -1, 0, 0, 0], [1, 1, 0, 1, 1, 1], [1, 1, 0, 1, 1, -1], [1, 1, 0, 1, 1, 0], [1, 1, 0, 1, -1, 1], [1, 1, 0, 1, -1, -1], [1, 1, 0, 1, -1, 0], [1, 1, 0, 1, 0, 1], [1, 1, 0, 1, 0, -1], [1, 1, 0, 1, 0, 0], [1, 1, 0, -1, 1, 1], [1, 1, 0, -1, 1, -1], [1, 1, 0, -1, 1, 0], [1, 1, 0, -1, -1, 1], [1, 1, 0, -1, 0, 1], [1, 1, 0, -1, 0, 0], [1, 1, 0, 0, 1, 1], [1, 1, 0, 0, 1, -1], [1, 1, 0, 0, 1, 0], [1, 1, 0, 0, -1, 1], [1, 1, 0, 0, -1, 0], [1, 1, 0, 0, 0, 1], [1, 1, 0, 0, 0, -1], [1, 1, 0, 0, 0, 0], [1, -1, 1, 1, 1, 1], [1, -1, 1, 1, 1, -1], [1, -1, 1, 1, 1, 0], [1, -1, 1, 1, -1, 1], [1, -1, 1, 1, -1, 0], [1, -1, 1, 1, 0, 1], [1, -1, 1, 1, 0, -1], [1, -1, 1, 1, 0, 0], [1, -1, 1, -1, 1, 1], [1, -1, 1, -1, 1, 0], [1, -1, 1, -1, 0, 1], [1, -1, 1, 0, 1, 1], [1, -1, 1, 0, 1, -1], [1, -1, 1, 0, 1, 0], [1, -1, 1, 0, -1, 1], [1, -1, 1, 0, 0, 1], [1, -1, 1, 0, 0, 0], [1, -1, -1, 1, 1, 1], [1, -1, -1, 1, 1, 0], [1, -1, -1, 1, 0, 1], [1, -1, -1, 0, 1, 1], [1, -1, 0, 1, 1, 1], [1, -1, 0, 1, 1, -1], [1, -1, 0, 1, 1, 0], [1, -1, 0, 1, -1, 1], [1, -1, 0, 1, 0, 1], [1, -1, 0, 1, 0, 0], [1, -1, 0, -1, 1, 1], [1, -1, 0, 0, 1, 1], [1, -1, 0, 0, 1, 0], [1, -1, 0, 0, 0, 1], [1, 0, 1, 1, 1, 1], [1, 0, 1, 1, 1, -1], [1, 0, 1, 1, 1, 0], [1, 0, 1, 1, -1, 1], [1, 0, 1, 1, -1, -1], [1, 0, 1, 1, -1, 0], [1, 0, 1, 1, 0, 1], [1, 0, 1, 1, 0, -1], [1, 0, 1, 1, 0, 0], [1, 0, 1, -1, 1, 1], [1, 0, 1, -1, 1, -1], [1, 0, 1, -1, 1, 0], [1, 0, 1, -1, -1, 1], [1, 0, 1, -1, 0, 1], [1, 0, 1, -1, 0, 0], [1, 0, 1, 0, 1, 1], [1, 0, 1, 0, 1, -1], [1, 0, 1, 0, 1, 0], [1, 0, 1, 0, -1, 1], [1, 0, 1, 0, -1, 0], [1, 0, 1, 0, 0, 1], [1, 0, 1, 0, 0, -1], [1, 0, 1, 0, 0, 0], [1, 0, -1, 1, 1, 1], [1, 0, -1, 1, 1, -1], [1, 0, -1, 1, 1, 0], [1, 0, -1, 1, -1, 1], [1, 0, -1, 1, 0, 1], [1, 0, -1, 1, 0, 0], [1, 0, -1, -1, 1, 1], [1, 0, -1, 0, 1, 1], [1, 0, -1, 0, 1, 0], [1, 0, -1, 0, 0, 1], [1, 0, 0, 1, 1, 1], [1, 0, 0, 1, 1, -1], [1, 0, 0, 1, 1, 0], [1, 0, 0, 1, -1, 1], [1, 0, 0, 1, -1, 0], [1, 0, 0, 1, 0, 1], [1, 0, 0, 1, 0, -1], [1, 0, 0, 1, 0, 0], [1, 0, 0, -1, 1, 1], [1, 0, 0, -1, 1, 0], [1, 0, 0, -1, 0, 1], [1, 0, 0, 0, 1, 1], [1, 0, 0, 0, 1, -1], [1, 0, 0, 0, 1, 0], [1, 0, 0, 0, -1, 1], [1, 0, 0, 0, 0, 1], [1, 0, 0, 0, 0, 0], [-1, 1, 1, 1, 1, 1], [-1, 1, 1, 1, 1, -1], [-1, 1, 1, 1, 1, 0], [-1, 1, 1, 1, -1, 1], [-1, 1, 1, 1, -1, 0], [-1, 1, 1, 1, 0, 1], [-1, 1, 1, 1, 0, -1], [-1, 1, 1, 1, 0, 0], [-1, 1, 1, -1, 1, 1], [-1, 1, 1, -1, 1, 0], [-1, 1, 1, -1, 0, 1], [-1, 1, 1, 0, 1, 1], [-1, 1, 1, 0, 1, -1], [-1, 1, 1, 0, 1, 0], [-1, 1, 1, 0, -1, 1], [-1, 1, 1, 0, 0, 1], [-1, 1, 1, 0, 0, 0], [-1, 1, -1, 1, 1, 1], [-1, 1, -1, 1, 1, 0], [-1, 1, -1, 1, 0, 1], [-1, 1, -1, 0, 1, 1], [-1, 1, 0, 1, 1, 1], [-1, 1, 0, 1, 1, -1], [-1, 1, 0, 1, 1, 0], [-1, 1, 0, 1, -1, 1], [-1, 1, 0, 1, 0, 1], [-1, 1, 0, 1, 0, 0], [-1, 1, 0, -1, 1, 1], [-1, 1, 0, 0, 1, 1], [-1, 1, 0, 0, 1, 0], [-1, 1, 0, 0, 0, 1], [-1, -1, 1, 1, 1, 1], [-1, -1, 1, 1, 1, 0], [-1, -1, 1, 1, 0, 1], [-1, -1, 1, 0, 1, 1], [-1, -1, 0, 1, 1, 1], [-1, 0, 1, 1, 1, 1], [-1, 0, 1, 1, 1, -1], [-1, 0, 1, 1, 1, 0], [-1, 0, 1, 1, -1, 1], [-1, 0, 1, 1, 0, 1], [-1, 0, 1, 1, 0, 0], [-1, 0, 1, -1, 1, 1], [-1, 0, 1, 0, 1, 1], [-1, 0, 1, 0, 1, 0], [-1, 0, 1, 0, 0, 1], [-1, 0, -1, 1, 1, 1], [-1, 0, 0, 1, 1, 1], [-1, 0, 0, 1, 1, 0], [-1, 0, 0, 1, 0, 1], [-1, 0, 0, 0, 1, 1], [0, 1, 1, 1, 1, 1], [0, 1, 1, 1, 1, -1], [0, 1, 1, 1, 1, 0], [0, 1, 1, 1, -1, 1], [0, 1, 1, 1, -1, -1], [0, 1, 1, 1, -1, 0], [0, 1, 1, 1, 0, 1], [0, 1, 1, 1, 0, -1], [0, 1, 1, 1, 0, 0], [0, 1, 1, -1, 1, 1], [0, 1, 1, -1, 1, -1], [0, 1, 1, -1, 1, 0], [0, 1, 1, -1, -1, 1], [0, 1, 1, -1, 0, 1], [0, 1, 1, -1, 0, 0], [0, 1, 1, 0, 1, 1], [0, 1, 1, 0, 1, -1], [0, 1, 1, 0, 1, 0], [0, 1, 1, 0, -1, 1], [0, 1, 1, 0, -1, 0], [0, 1, 1, 0, 0, 1], [0, 1, 1, 0, 0, -1], [0, 1, 1, 0, 0, 0], [0, 1, -1, 1, 1, 1], [0, 1, -1, 1, 1, -1], [0, 1, -1, 1, 1, 0], [0, 1, -1, 1, -1, 1], [0, 1, -1, 1, 0, 1], [0, 1, -1, 1, 0, 0], [0, 1, -1, -1, 1, 1], [0, 1, -1, 0, 1, 1], [0, 1, -1, 0, 1, 0], [0, 1, -1, 0, 0, 1], [0, 1, 0, 1, 1, 1], [0, 1, 0, 1, 1, -1], [0, 1, 0, 1, 1, 0], [0, 1, 0, 1, -1, 1], [0, 1, 0, 1, -1, 0], [0, 1, 0, 1, 0, 1], [0, 1, 0, 1, 0, -1], [0, 1, 0, 1, 0, 0], [0, 1, 0, -1, 1, 1], [0, 1, 0, -1, 1, 0], [0, 1, 0, -1, 0, 1], [0, 1, 0, 0, 1, 1], [0, 1, 0, 0, 1, -1], [0, 1, 0, 0, 1, 0], [0, 1, 0, 0, -1, 1], [0, 1, 0, 0, 0, 1], [0, 1, 0, 0, 0, 0], [0, -1, 1, 1, 1, 1], [0, -1, 1, 1, 1, -1], [0, -1, 1, 1, 1, 0], [0, -1, 1, 1, -1, 1], [0, -1, 1, 1, 0, 1], [0, -1, 1, 1, 0, 0], [0, -1, 1, -1, 1, 1], [0, -1, 1, 0, 1, 1], [0, -1, 1, 0, 1, 0], [0, -1, 1, 0, 0, 1], [0, -1, -1, 1, 1, 1], [0, -1, 0, 1, 1, 1], [0, -1, 0, 1, 1, 0], [0, -1, 0, 1, 0, 1], [0, -1, 0, 0, 1, 1], [0, 0, 1, 1, 1, 1], [0, 0, 1, 1, 1, -1], [0, 0, 1, 1, 1, 0], [0, 0, 1, 1, -1, 1], [0, 0, 1, 1, -1, 0], [0, 0, 1, 1, 0, 1], [0, 0, 1, 1, 0, -1], [0, 0, 1, 1, 0, 0], [0, 0, 1, -1, 1, 1], [0, 0, 1, -1, 1, 0], [0, 0, 1, -1, 0, 1], [0, 0, 1, 0, 1, 1], [0, 0, 1, 0, 1, -1], [0, 0, 1, 0, 1, 0], [0, 0, 1, 0, -1, 1], [0, 0, 1, 0, 0, 1], [0, 0, 1, 0, 0, 0], [0, 0, -1, 1, 1, 1], [0, 0, -1, 1, 1, 0], [0, 0, -1, 1, 0, 1], [0, 0, -1, 0, 1, 1], [0, 0, 0, 1, 1, 1], [0, 0, 0, 1, 1, -1], [0, 0, 0, 1, 1, 0], [0, 0, 0, 1, -1, 1], [0, 0, 0, 1, 0, 1], [0, 0, 0, 1, 0, 0], [0, 0, 0, -1, 1, 1], [0, 0, 0, 0, 1, 1], [0, 0, 0, 0, 1, 0], [0, 0, 0, 0, 0, 1]],
  :negative => [[1, 1, -1, -1, -1, -1], [1, 1, -1, -1, -1, 0], [1, 1, -1, -1, 0, -1], [1, 1, -1, 0, -1, -1], [1, 1, 0, -1, -1, -1], [1, -1, 1, -1, -1, -1], [1, -1, 1, -1, -1, 0], [1, -1, 1, -1, 0, -1], [1, -1, 1, 0, -1, -1], [1, -1, -1, 1, -1, -1], [1, -1, -1, 1, -1, 0], [1, -1, -1, 1, 0, -1], [1, -1, -1, -1, 1, -1], [1, -1, -1, -1, 1, 0], [1, -1, -1, -1, -1, 1], [1, -1, -1, -1, -1, -1], [1, -1, -1, -1, -1, 0], [1, -1, -1, -1, 0, 1], [1, -1, -1, -1, 0, -1], [1, -1, -1, -1, 0, 0], [1, -1, -1, 0, 1, -1], [1, -1, -1, 0, -1, 1], [1, -1, -1, 0, -1, -1], [1, -1, -1, 0, -1, 0], [1, -1, -1, 0, 0, -1], [1, -1, -1, 0, 0, 0], [1, -1, 0, 1, -1, -1], [1, -1, 0, -1, 1, -1], [1, -1, 0, -1, -1, 1], [1, -1, 0, -1, -1, -1], [1, -1, 0, -1, -1, 0], [1, -1, 0, -1, 0, -1], [1, -1, 0, -1, 0, 0], [1, -1, 0, 0, -1, -1], [1, -1, 0, 0, -1, 0], [1, -1, 0, 0, 0, -1], [1, 0, 1, -1, -1, -1], [1, 0, -1, 1, -1, -1], [1, 0, -1, -1, 1, -1], [1, 0, -1, -1, -1, 1], [1, 0, -1, -1, -1, -1], [1, 0, -1, -1, -1, 0], [1, 0, -1, -1, 0, -1], [1, 0, -1, -1, 0, 0], [1, 0, -1, 0, -1, -1], [1, 0, -1, 0, -1, 0], [1, 0, -1, 0, 0, -1], [1, 0, 0, -1, -1, -1], [1, 0, 0, -1, -1, 0], [1, 0, 0, -1, 0, -1], [1, 0, 0, 0, -1, -1], [-1, 1, 1, -1, -1, -1], [-1, 1, 1, -1, -1, 0], [-1, 1, 1, -1, 0, -1], [-1, 1, 1, 0, -1, -1], [-1, 1, -1, 1, -1, -1], [-1, 1, -1, 1, -1, 0], [-1, 1, -1, 1, 0, -1], [-1, 1, -1, -1, 1, -1], [-1, 1, -1, -1, 1, 0], [-1, 1, -1, -1, -1, 1], [-1, 1, -1, -1, -1, -1], [-1, 1, -1, -1, -1, 0], [-1, 1, -1, -1, 0, 1], [-1, 1, -1, -1, 0, -1], [-1, 1, -1, -1, 0, 0], [-1, 1, -1, 0, 1, -1], [-1, 1, -1, 0, -1, 1], [-1, 1, -1, 0, -1, -1], [-1, 1, -1, 0, -1, 0], [-1, 1, -1, 0, 0, -1], [-1, 1, -1, 0, 0, 0], [-1, 1, 0, 1, -1, -1], [-1, 1, 0, -1, 1, -1], [-1, 1, 0, -1, -1, 1], [-1, 1, 0, -1, -1, -1], [-1, 1, 0, -1, -1, 0], [-1, 1, 0, -1, 0, -1], [-1, 1, 0, -1, 0, 0], [-1, 1, 0, 0, -1, -1], [-1, 1, 0, 0, -1, 0], [-1, 1, 0, 0, 0, -1], [-1, -1, 1, 1, -1, -1], [-1, -1, 1, 1, -1, 0], [-1, -1, 1, 1, 0, -1], [-1, -1, 1, -1, 1, -1], [-1, -1, 1, -1, 1, 0], [-1, -1, 1, -1, -1, 1], [-1, -1, 1, -1, -1, -1], [-1, -1, 1, -1, -1, 0], [-1, -1, 1, -1, 0, 1], [-1, -1, 1, -1, 0, -1], [-1, -1, 1, -1, 0, 0], [-1, -1, 1, 0, 1, -1], [-1, -1, 1, 0, -1, 1], [-1, -1, 1, 0, -1, -1], [-1, -1, 1, 0, -1, 0], [-1, -1, 1, 0, 0, -1], [-1, -1, 1, 0, 0, 0], [-1, -1, -1, 1, 1, -1], [-1, -1, -1, 1, 1, 0], [-1, -1, -1, 1, -1, 1], [-1, -1, -1, 1, -1, -1], [-1, -1, -1, 1, -1, 0], [-1, -1, -1, 1, 0, 1], [-1, -1, -1, 1, 0, -1], [-1, -1, -1, 1, 0, 0], [-1, -1, -1, -1, 1, 1], [-1, -1, -1, -1, 1, -1], [-1, -1, -1, -1, 1, 0], [-1, -1, -1, -1, -1, 1], [-1, -1, -1, -1, -1, -1], [-1, -1, -1, -1, -1, 0], [-1, -1, -1, -1, 0, 1], [-1, -1, -1, -1, 0, -1], [-1, -1, -1, -1, 0, 0], [-1, -1, -1, 0, 1, 1], [-1, -1, -1, 0, 1, -1], [-1, -1, -1, 0, 1, 0], [-1, -1, -1, 0, -1, 1], [-1, -1, -1, 0, -1, -1], [-1, -1, -1, 0, -1, 0], [-1, -1, -1, 0, 0, 1], [-1, -1, -1, 0, 0, -1], [-1, -1, -1, 0, 0, 0], [-1, -1, 0, 1, 1, -1], [-1, -1, 0, 1, -1, 1], [-1, -1, 0, 1, -1, -1], [-1, -1, 0, 1, -1, 0], [-1, -1, 0, 1, 0, -1], [-1, -1, 0, 1, 0, 0], [-1, -1, 0, -1, 1, 1], [-1, -1, 0, -1, 1, -1], [-1, -1, 0, -1, 1, 0], [-1, -1, 0, -1, -1, 1], [-1, -1, 0, -1, -1, -1], [-1, -1, 0, -1, -1, 0], [-1, -1, 0, -1, 0, 1], [-1, -1, 0, -1, 0, -1], [-1, -1, 0, -1, 0, 0], [-1, -1, 0, 0, 1, -1], [-1, -1, 0, 0, 1, 0], [-1, -1, 0, 0, -1, 1], [-1, -1, 0, 0, -1, -1], [-1, -1, 0, 0, -1, 0], [-1, -1, 0, 0, 0, 1], [-1, -1, 0, 0, 0, -1], [-1, -1, 0, 0, 0, 0], [-1, 0, 1, 1, -1, -1], [-1, 0, 1, -1, 1, -1], [-1, 0, 1, -1, -1, 1], [-1, 0, 1, -1, -1, -1], [-1, 0, 1, -1, -1, 0], [-1, 0, 1, -1, 0, -1], [-1, 0, 1, -1, 0, 0], [-1, 0, 1, 0, -1, -1], [-1, 0, 1, 0, -1, 0], [-1, 0, 1, 0, 0, -1], [-1, 0, -1, 1, 1, -1], [-1, 0, -1, 1, -1, 1], [-1, 0, -1, 1, -1, -1], [-1, 0, -1, 1, -1, 0], [-1, 0, -1, 1, 0, -1], [-1, 0, -1, 1, 0, 0], [-1, 0, -1, -1, 1, 1], [-1, 0, -1, -1, 1, -1], [-1, 0, -1, -1, 1, 0], [-1, 0, -1, -1, -1, 1], [-1, 0, -1, -1, -1, -1], [-1, 0, -1, -1, -1, 0], [-1, 0, -1, -1, 0, 1], [-1, 0, -1, -1, 0, -1], [-1, 0, -1, -1, 0, 0], [-1, 0, -1, 0, 1, -1], [-1, 0, -1, 0, 1, 0], [-1, 0, -1, 0, -1, 1], [-1, 0, -1, 0, -1, -1], [-1, 0, -1, 0, -1, 0], [-1, 0, -1, 0, 0, 1], [-1, 0, -1, 0, 0, -1], [-1, 0, -1, 0, 0, 0], [-1, 0, 0, 1, -1, -1], [-1, 0, 0, 1, -1, 0], [-1, 0, 0, 1, 0, -1], [-1, 0, 0, -1, 1, -1], [-1, 0, 0, -1, 1, 0], [-1, 0, 0, -1, -1, 1], [-1, 0, 0, -1, -1, -1], [-1, 0, 0, -1, -1, 0], [-1, 0, 0, -1, 0, 1], [-1, 0, 0, -1, 0, -1], [-1, 0, 0, -1, 0, 0], [-1, 0, 0, 0, 1, -1], [-1, 0, 0, 0, -1, 1], [-1, 0, 0, 0, -1, -1], [-1, 0, 0, 0, -1, 0], [-1, 0, 0, 0, 0, -1], [-1, 0, 0, 0, 0, 0], [0, 1, 1, -1, -1, -1], [0, 1, -1, 1, -1, -1], [0, 1, -1, -1, 1, -1], [0, 1, -1, -1, -1, 1], [0, 1, -1, -1, -1, -1], [0, 1, -1, -1, -1, 0], [0, 1, -1, -1, 0, -1], [0, 1, -1, -1, 0, 0], [0, 1, -1, 0, -1, -1], [0, 1, -1, 0, -1, 0], [0, 1, -1, 0, 0, -1], [0, 1, 0, -1, -1, -1], [0, 1, 0, -1, -1, 0], [0, 1, 0, -1, 0, -1], [0, 1, 0, 0, -1, -1], [0, -1, 1, 1, -1, -1], [0, -1, 1, -1, 1, -1], [0, -1, 1, -1, -1, 1], [0, -1, 1, -1, -1, -1], [0, -1, 1, -1, -1, 0], [0, -1, 1, -1, 0, -1], [0, -1, 1, -1, 0, 0], [0, -1, 1, 0, -1, -1], [0, -1, 1, 0, -1, 0], [0, -1, 1, 0, 0, -1], [0, -1, -1, 1, 1, -1], [0, -1, -1, 1, -1, 1], [0, -1, -1, 1, -1, -1], [0, -1, -1, 1, -1, 0], [0, -1, -1, 1, 0, -1], [0, -1, -1, 1, 0, 0], [0, -1, -1, -1, 1, 1], [0, -1, -1, -1, 1, -1], [0, -1, -1, -1, 1, 0], [0, -1, -1, -1, -1, 1], [0, -1, -1, -1, -1, -1], [0, -1, -1, -1, -1, 0], [0, -1, -1, -1, 0, 1], [0, -1, -1, -1, 0, -1], [0, -1, -1, -1, 0, 0], [0, -1, -1, 0, 1, -1], [0, -1, -1, 0, 1, 0], [0, -1, -1, 0, -1, 1], [0, -1, -1, 0, -1, -1], [0, -1, -1, 0, -1, 0], [0, -1, -1, 0, 0, 1], [0, -1, -1, 0, 0, -1], [0, -1, -1, 0, 0, 0], [0, -1, 0, 1, -1, -1], [0, -1, 0, 1, -1, 0], [0, -1, 0, 1, 0, -1], [0, -1, 0, -1, 1, -1], [0, -1, 0, -1, 1, 0], [0, -1, 0, -1, -1, 1], [0, -1, 0, -1, -1, -1], [0, -1, 0, -1, -1, 0], [0, -1, 0, -1, 0, 1], [0, -1, 0, -1, 0, -1], [0, -1, 0, -1, 0, 0], [0, -1, 0, 0, 1, -1], [0, -1, 0, 0, -1, 1], [0, -1, 0, 0, -1, -1], [0, -1, 0, 0, -1, 0], [0, -1, 0, 0, 0, -1], [0, -1, 0, 0, 0, 0], [0, 0, 1, -1, -1, -1], [0, 0, 1, -1, -1, 0], [0, 0, 1, -1, 0, -1], [0, 0, 1, 0, -1, -1], [0, 0, -1, 1, -1, -1], [0, 0, -1, 1, -1, 0], [0, 0, -1, 1, 0, -1], [0, 0, -1, -1, 1, -1], [0, 0, -1, -1, 1, 0], [0, 0, -1, -1, -1, 1], [0, 0, -1, -1, -1, -1], [0, 0, -1, -1, -1, 0], [0, 0, -1, -1, 0, 1], [0, 0, -1, -1, 0, -1], [0, 0, -1, -1, 0, 0], [0, 0, -1, 0, 1, -1], [0, 0, -1, 0, -1, 1], [0, 0, -1, 0, -1, -1], [0, 0, -1, 0, -1, 0], [0, 0, -1, 0, 0, -1], [0, 0, -1, 0, 0, 0], [0, 0, 0, 1, -1, -1], [0, 0, 0, -1, 1, -1], [0, 0, 0, -1, -1, 1], [0, 0, 0, -1, -1, -1], [0, 0, 0, -1, -1, 0], [0, 0, 0, -1, 0, -1], [0, 0, 0, -1, 0, 0], [0, 0, 0, 0, -1, -1], [0, 0, 0, 0, -1, 0], [0, 0, 0, 0, 0, -1]],
  :neutral => [[1, 1, 1, -1, -1, -1], [1, 1, -1, 1, -1, -1], [1, 1, -1, -1, 1, -1], [1, 1, -1, -1, -1, 1], [1, 1, -1, -1, 0, 0], [1, 1, -1, 0, -1, 0], [1, 1, -1, 0, 0, -1], [1, 1, 0, -1, -1, 0], [1, 1, 0, -1, 0, -1], [1, 1, 0, 0, -1, -1], [1, -1, 1, 1, -1, -1], [1, -1, 1, -1, 1, -1], [1, -1, 1, -1, -1, 1], [1, -1, 1, -1, 0, 0], [1, -1, 1, 0, -1, 0], [1, -1, 1, 0, 0, -1], [1, -1, -1, 1, 1, -1], [1, -1, -1, 1, -1, 1], [1, -1, -1, 1, 0, 0], [1, -1, -1, -1, 1, 1], [1, -1, -1, 0, 1, 0], [1, -1, -1, 0, 0, 1], [1, -1, 0, 1, -1, 0], [1, -1, 0, 1, 0, -1], [1, -1, 0, -1, 1, 0], [1, -1, 0, -1, 0, 1], [1, -1, 0, 0, 1, -1], [1, -1, 0, 0, -1, 1], [1, -1, 0, 0, 0, 0], [1, 0, 1, -1, -1, 0], [1, 0, 1, -1, 0, -1], [1, 0, 1, 0, -1, -1], [1, 0, -1, 1, -1, 0], [1, 0, -1, 1, 0, -1], [1, 0, -1, -1, 1, 0], [1, 0, -1, -1, 0, 1], [1, 0, -1, 0, 1, -1], [1, 0, -1, 0, -1, 1], [1, 0, -1, 0, 0, 0], [1, 0, 0, 1, -1, -1], [1, 0, 0, -1, 1, -1], [1, 0, 0, -1, -1, 1], [1, 0, 0, -1, 0, 0], [1, 0, 0, 0, -1, 0], [1, 0, 0, 0, 0, -1], [-1, 1, 1, 1, -1, -1], [-1, 1, 1, -1, 1, -1], [-1, 1, 1, -1, -1, 1], [-1, 1, 1, -1, 0, 0], [-1, 1, 1, 0, -1, 0], [-1, 1, 1, 0, 0, -1], [-1, 1, -1, 1, 1, -1], [-1, 1, -1, 1, -1, 1], [-1, 1, -1, 1, 0, 0], [-1, 1, -1, -1, 1, 1], [-1, 1, -1, 0, 1, 0], [-1, 1, -1, 0, 0, 1], [-1, 1, 0, 1, -1, 0], [-1, 1, 0, 1, 0, -1], [-1, 1, 0, -1, 1, 0], [-1, 1, 0, -1, 0, 1], [-1, 1, 0, 0, 1, -1], [-1, 1, 0, 0, -1, 1], [-1, 1, 0, 0, 0, 0], [-1, -1, 1, 1, 1, -1], [-1, -1, 1, 1, -1, 1], [-1, -1, 1, 1, 0, 0], [-1, -1, 1, -1, 1, 1], [-1, -1, 1, 0, 1, 0], [-1, -1, 1, 0, 0, 1], [-1, -1, -1, 1, 1, 1], [-1, -1, 0, 1, 1, 0], [-1, -1, 0, 1, 0, 1], [-1, -1, 0, 0, 1, 1], [-1, 0, 1, 1, -1, 0], [-1, 0, 1, 1, 0, -1], [-1, 0, 1, -1, 1, 0], [-1, 0, 1, -1, 0, 1], [-1, 0, 1, 0, 1, -1], [-1, 0, 1, 0, -1, 1], [-1, 0, 1, 0, 0, 0], [-1, 0, -1, 1, 1, 0], [-1, 0, -1, 1, 0, 1], [-1, 0, -1, 0, 1, 1], [-1, 0, 0, 1, 1, -1], [-1, 0, 0, 1, -1, 1], [-1, 0, 0, 1, 0, 0], [-1, 0, 0, -1, 1, 1], [-1, 0, 0, 0, 1, 0], [-1, 0, 0, 0, 0, 1], [0, 1, 1, -1, -1, 0], [0, 1, 1, -1, 0, -1], [0, 1, 1, 0, -1, -1], [0, 1, -1, 1, -1, 0], [0, 1, -1, 1, 0, -1], [0, 1, -1, -1, 1, 0], [0, 1, -1, -1, 0, 1], [0, 1, -1, 0, 1, -1], [0, 1, -1, 0, -1, 1], [0, 1, -1, 0, 0, 0], [0, 1, 0, 1, -1, -1], [0, 1, 0, -1, 1, -1], [0, 1, 0, -1, -1, 1], [0, 1, 0, -1, 0, 0], [0, 1, 0, 0, -1, 0], [0, 1, 0, 0, 0, -1], [0, -1, 1, 1, -1, 0], [0, -1, 1, 1, 0, -1], [0, -1, 1, -1, 1, 0], [0, -1, 1, -1, 0, 1], [0, -1, 1, 0, 1, -1], [0, -1, 1, 0, -1, 1], [0, -1, 1, 0, 0, 0], [0, -1, -1, 1, 1, 0], [0, -1, -1, 1, 0, 1], [0, -1, -1, 0, 1, 1], [0, -1, 0, 1, 1, -1], [0, -1, 0, 1, -1, 1], [0, -1, 0, 1, 0, 0], [0, -1, 0, -1, 1, 1], [0, -1, 0, 0, 1, 0], [0, -1, 0, 0, 0, 1], [0, 0, 1, 1, -1, -1], [0, 0, 1, -1, 1, -1], [0, 0, 1, -1, -1, 1], [0, 0, 1, -1, 0, 0], [0, 0, 1, 0, -1, 0], [0, 0, 1, 0, 0, -1], [0, 0, -1, 1, 1, -1], [0, 0, -1, 1, -1, 1], [0, 0, -1, 1, 0, 0], [0, 0, -1, -1, 1, 1], [0, 0, -1, 0, 1, 0], [0, 0, -1, 0, 0, 1], [0, 0, 0, 1, -1, 0], [0, 0, 0, 1, 0, -1], [0, 0, 0, -1, 1, 0], [0, 0, 0, -1, 0, 1], [0, 0, 0, 0, 1, -1], [0, 0, 0, 0, -1, 1]]
}

COMBINATIONS_SUMMER = {
  :positive => [[1, 1, 1, 1], [1, 1, 1, -1], [1, 1, 1, 0], [1, 1, -1, 1], [1, 1, -1, 0], [1, 1, 0, 1], [1, 1, 0, -1], [1, 1, 0, 0], [1, -1, 1, 1], [1, -1, 1, 0], [1, -1, 0, 1], [1, 0, 1, 1], [1, 0, 1, -1], [1, 0, 1, 0], [1, 0, -1, 1], [1, 0, 0, 1], [1, 0, 0, 0], [-1, 1, 1, 1], [-1, 1, 1, 0], [-1, 1, 0, 1], [-1, 0, 1, 1], [0, 1, 1, 1], [0, 1, 1, -1], [0, 1, 1, 0], [0, 1, -1, 1], [0, 1, 0, 1], [0, 1, 0, 0], [0, -1, 1, 1], [0, 0, 1, 1], [0, 0, 1, 0], [0, 0, 0, 1]],
  :negative => [[1, -1, -1, -1], [1, -1, -1, 0], [1, -1, 0, -1], [1, 0, -1, -1], [-1, 1, -1, -1], [-1, 1, -1, 0], [-1, 1, 0, -1], [-1, -1, 1, -1], [-1, -1, 1, 0], [-1, -1, -1, 1], [-1, -1, -1, -1], [-1, -1, -1, 0], [-1, -1, 0, 1], [-1, -1, 0, -1], [-1, -1, 0, 0], [-1, 0, 1, -1], [-1, 0, -1, 1], [-1, 0, -1, -1], [-1, 0, -1, 0], [-1, 0, 0, -1], [-1, 0, 0, 0], [0, 1, -1, -1], [0, -1, 1, -1], [0, -1, -1, 1], [0, -1, -1, -1], [0, -1, -1, 0], [0, -1, 0, -1], [0, -1, 0, 0], [0, 0, -1, -1], [0, 0, -1, 0], [0, 0, 0, -1]],
  :neutral => [[1, 1, -1, -1], [1, -1, 1, -1], [1, -1, -1, 1], [1, -1, 0, 0], [1, 0, -1, 0], [1, 0, 0, -1], [-1, 1, 1, -1], [-1, 1, -1, 1], [-1, 1, 0, 0], [-1, -1, 1, 1], [-1, 0, 1, 0], [-1, 0, 0, 1], [0, 1, -1, 0], [0, 1, 0, -1], [0, -1, 1, 0], [0, -1, 0, 1], [0, 0, 1, -1], [0, 0, -1, 1]]
}

TEXT_LENGTH = [[1, 10], [10, 40], [30, 60], [50, 120]]

# ==================================

FEMALE_NAMES = {
  names_ua: [
    "Анна", "Анастасія", "Вікторія", "Ольга", "Марія", "Катерина", "Наталія", "Юлія", "Дарина", "Ірина",
    "Єлизавета", "Тетяна", "Софія", "Аліна", "Ксенія", "Марина", "Людмила", "Вероніка", "Олена", "Аліса",
    "Злата", "Ева", "Марта", "Ярослава", "Сніжана", "Світлана", "Дарія", "Поліна",  "Ліза",
    "Мілана", "Ілона", "Валерія", "Діана", "Богдана", "Соломія", "Аміна", "Мирослава", "Роксолана", "Надія",
    "Зоряна", "Аліна", "Валентина", "Софія", "Юстина", "Влада", "Іванна", "Олександра", "Ганна",
    "Лідія", "Уляна", "Таїсія", "Оксана", "Яна", "Майя", "Каріна", "Маргарита", "Леся", "Еліна",
    "Аделіна", "Інна", "Орися", "Альона", "Віра", "Ніка", "Олеся", "Лілія", "Василина", "Галина",
    "Антоніна", "Мирослава", "Ірина", "Віталія", "Сабіна", "Любов", "Емілія", "Кіра", "Аріна", "Стефанія",
    "Наталя", "Дар'я", "Олександра", "Агата", "Ізабелла", "Агнія", "Клавдія", "Серафима", "Влада",
    "Аліса", "Нонна", "Зоя", "Лариса", "Фаїна",  "Валерія", "Юлія", "Меланія"
  ],
  diminutive_names_ua: [
    "Аня", "Настя", "Віка", "Оля", "Маша", "Катя", "Наташа", "Юля", "Даша", "Іра",
    "Ліза", "Таня", "Софійка", "Аліна", "Ксюша", "Маринка", "Люда", "Віка", "Лєна", "Аліса",
    "Злата", "Єва", "Марта", "Яся", "Сніжана", "Свєта", "Даша", "Поліна", "Емма", "Ліза",
    "Міла", "Ілона", "Лєра", "Діана", "Богданка", "Соля", "Аміна", "Міра", "Рокса", "Надя",
    "Зоряна", "Алінка", "Валя", "Соня", "Юстина", "Влада", "Іванка", "Саша", "Анечка",
    "Ліда", "Уляна", "Тася", "Оксана", "Яна", "Майя", "Каріна", "Рита", "Леся", "Еля",
    "Аделіна", "Інна", "Орися", "Альона", "Віра", "Ніка", "Олеся", "Ліля", "Вася", "Галя",
    "Тоня", "Мирослава", "Ірина", "Віталія", "Сабіна", "Любов", "Емма", "Кіра", "Арина",
    "Наташа", "Даша", "Саша", "Агата", "Іза", "Агнія", "Клава", "Серафима", "Влада",
    "Аміна", "Аліса", "Нонна", "Зоя", "Лариса", "Фая", "Люція", "Лєра", "Юля", "Меланія"
  ],
  names_ru: [
    "Анна", "Анастасия", "Виктория", "Ольга", "Мария", "Екатерина", "Наталья", "Юлия", "Дарья", "Ирина",
    "Елизавета", "Татьяна", "София", "Алина", "Ксения", "Марина", "Людмила", "Вероника", "Елена", "Алиса",
    "Злата", "Ева", "Марта", "Ярослава", "Снежана", "Светлана", "Дария", "Полина", "Эмилия", "Лиза",
    "Милана", "Илона", "Валерия", "Диана", "Богдана",   "Мирослава", "Роксолана", "Надежда",
    "Зоряна", "Алина", "Валентина", "София", "Юстина", "Влада", "Иванна", "Александра",
    "Лидия", "Ульяна", "Таисия", "Оксана", "Яна", "Майя", "Карина", "Маргарита", "Леся", "Элина",
    "Аделина", "Инна", "Орыся", "Алена", "Вера", "Ника", "Олеся", "Лилия", "Василина", "Галина",
    "Антонина", "Мирослава", "Ирина", "Виталия", "Сабина", "Любовь", "Эмилия", "Кира", "Арина", "Стефания",
    "Наталья", "Дарья", "Александра", "Агата", "Изабелла", "Агния", "Клавдия", "Серафима", "Влада", "Адель",
    "Амина", "Алиса", "Нонна", "Зоя", "Лариса", "Фаина", "Люция", "Валерия", "Юлия", "Мелания"
  ],
  diminutive_names_ru: [
    "Аня", "Настя", "Вика", "Оля", "Маша", "Катя", "Наташа", "Юля", "Даша", "Ира",
    "Лиза", "Таня", "София", "Алина", "Ксюша", "Марина", "Люда", "Вероника", "Лена", "Алиса",
    "Злата", "Ева", "Марта", "Яся", "Снежана", "Света", "Даша", "Поля", "Эмма", "Лиза",
    "Мила", "Илона", "Лера", "Диана", "Богдана", "Соля", "Амина", "Мира", "Рокси", "Надя",
    "Зоряна", "Алинка", "Валя", "Соня", "Юстина", "Влада", "Иванна", "Саша", "Анечка", "Регина",
    "Лида", "Уля", "Тася", "Оксана", "Яна", "Майя", "Карина", "Рита", "Леся", "Эля",
    "Аделина", "Инна", "Орыся", "Алена", "Вера", "Ника", "Олеся", "Лиля", "Вася", "Галя",
    "Тоня", "Мирослава", "Ирина", "Виталия", "Сабина", "Люба", "Эмма", "Кира", "Арина", "Стефа",
    "Наташа", "Даша", "Саша", "Агата", "Иза", "Агния", "Клава", "Серафима", "Влада", "Адель",
    "Амина", "Алиса", "Нонна", "Зоя", "Лариса", "Фая", "Люция", "Лера", "Юля", "Мелания"
  ],

  names_en: [
    "Anna", "Anastasia", "Victoria", "Olga", "Maria", "Ekaterina", "Natalia", "Julia", "Daria", "Irina",
    "Elizabeth", "Tatiana", "Sophia", "Alina", "Ksenia", "Marina", "Lyudmila", "Veronika", "Elena", "Alice",
    "Zlata", "Eva", "Marta", "Yaroslava", "Snezhana", "Svetlana", "Dariya", "Polina", "Emilia", "Liza",
    "Milana", "Ilona", "Valeria", "Diana", "Bogdana", "Solomiya", "Amina", "Miroslava", "Roksolana", "Nadezhda",
    "Zoryana", "Alina", "Valentina", "Sophia", "Justina", "Vlada", "Ivanna", "Alexandra", "Anna", "Regina",
    "Lidia", "Ulyana", "Taisia", "Oksana", "Yana", "Maya", "Karina", "Margarita", "Lesya", "Elina",
    "Adelina", "Inna", "Orysya", "Alena", "Vera", "Nika", "Olesya", "Lilia", "Vasylina", "Galina",
    "Antonina", "Miroslava", "Irina", "Vitalia", "Sabina", "Lyubov", "Emilia", "Kira", "Arina", "Stefania",
    "Natalia", "Darya", "Alexandra", "Agata", "Isabella", "Agnia", "Klavdia", "Serafima", "Vlada", "Adel",
    "Amina", "Alice", "Nonna", "Zoya", "Larisa", "Faina", "Lyutsia", "Valeria", "Julia", "Melania"
  ],
  diminutive_names_en: [
    "Anna", "Nastya", "Vika", "Olya", "Masha", "Katya", "Natasha", "Julia", "Dasha", "Ira",
    "Lisa", "Tanya", "Sophie", "Alina", "Ksyusha", "Marina", "Lyuda", "Veronica", "Lena", "Alice",
    "Zlata", "Eva", "Martha", "Yasya", "Snizhana", "Sveta", "Dasha", "Polly", "Emma", "Lisa",
    "Mila", "Ilona", "Lera", "Diana", "Bogdana", "Solya", "Amina", "Mira", "Roxie", "Nadia",
    "Zoriana", "Alinka", "Valya", "Sonya", "Justine", "Vlada", "Ivanna", "Sasha", "Annie", "Regina",
    "Lydia", "Ully", "Tasya", "Oksana", "Yana", "Maya", "Karina", "Rita", "Lesya", "Ella",
    "Adelina", "Inna", "Orisia", "Alena", "Vera", "Nika", "Olesya", "Lily", "Vasya", "Galya",
    "Tonya", "Miroslava", "Irina", "Vitaliya", "Sabina", "Lyubov", "Emma", "Kira", "Arina", "Steffa",
    "Natasha", "Dasha", "Sasha", "Agatha", "Iza", "Agnia", "Klava", "Seraphima", "Vlada", "Adel",
    "Amina", "Alice", "Nonna", "Zoya", "Larisa", "Faya", "Lucia", "Lera", "Yulia", "Melania"
  ]

}

MALE_NAMES = {
  names_ua: [
    "Олександр", "Андрій", "Дмитро", "Сергій", "Володимир", "Олег", "Іван", "Юрій", "Микола", "Михайло",
    "Віталій", "Богдан", "Максим", "Роман", "Петро", "Артем", "Ігор", "Євген", "Антон", "Павло",
    "Тарас", "Василь", "Григорій", "Олексій", "Леонід", "Арсеній", "Анатолій", "Вадим", "Кирило", "Ростислав",
    "Валерій", "Данило", "Леон", "Альберт", "Марко", "Борис", "Георгій", "Денис", "Віталій", "Святослав",
    "Ярослав", "Степан", "Валентин", "Мирослав", "Адам", "Єгор", "Ілля", "Матвій", "Юліан",
    "Захар", "Тимофій", "Федір", "Ян", "Давид",  "Артур", "Остап",  "Семен",
    "Микита", "Лев", "Віктор", "Даниїл", "Дамір", "Гліб", "Любомир", "Руслан", "Тимур",
    "Богдан", "Аркадій", "Мирон", "Валентин", "Володислав", "Едуард", "Остап",
    "Адріан", "Зиновій", "Родіон", "Данило", "Ераст",
    "Яким",  "Василь",  "Назар", "Євгеній", "Валентин", "Володимир", "Ернест", "Олександр"
  ],
  diminutive_names_ua: [
    "Олесь",  "Вова", "Олег",  "Коля", "Миша",
    "Вітя", "Богдан", "Макс", "Роман", "Петро", "Артем", "Ігор", "Женя", "Тоня", "Павло",
    "Тарас", "Василь", "Гриша", "Олексій", "Леонід", "Сеня", "Толя", "Славік", "Кіріл", "Ростик",
    "Валерій", "Данило", "Лєша", "Альберт", "Марк", "Борис", "Георгій", "Денис", "Святослав", "Ярік",
    "Степан", "Валентин", "Слава", "Адам", "Єгор", "Ілля", "Матвій",  "Богдан", "Валера",
    "Давид", "Артур", "Остап",  "Семен", "Микита", "Лев", "Вітя", "Даня", "Діма",
    "Гліб",  "Руслан", "Тимур", "Герман", "Бодя", "Аркадій", "Мирон", "Володя", "Ед",
    "Адріан", "Зіновій", "Родіон", "Ераст", "Опанас", "Яків",
     "Назар", "Євгеній", "Ернест"
  ],
  names_ru: [
    "Александр", "Андрей", "Дмитрий", "Сергей", "Владимир", "Олег", "Иван", "Юрий", "Николай", "Михаил",
    "Виталий", "Богдан", "Максим", "Роман", "Петр", "Артем", "Игорь", "Евгений", "Антон", "Павел",
    "Тарас", "Василий", "Григорий", "Алексей", "Леонид", "Арсений", "Анатолий", "Вадим", "Кирилл", "Ростислав",
    "Валерий", "Даниил", "Леон",  "Марк", "Борис", "Георгий", "Денис", "Виталий", "Святослав",
    "Ярослав", "Степан", "Валентин", "Мирослав", "Адам", "Егор", "Илья", "Матвей", "Юлиан", "Борислав",
    "Тимофей", "Федор", "Ян", "Давид", "Елисей", "Артур", "Остап",  "Семен",
    "Никита", "Лев", "Виктор", "Даниил", "Дамир", "Глеб", "Любомир", "Руслан", "Тимур",
    "Богдан", "Аркадий", "Мирон", "Валентин", "Владислав", "Эдуард",
    "Родион", "Данил", "Эраст",     "Василий", "Евгений",  "Владимир", "Эрнест", "Александр"
  ],
  diminutive_names_ru: [
    "Олег", "Андрюша", "Дима", "Сергей", "Вова", "Олег", "Иван", "Юра", "Коля", "Миша",
    "Витя", "Богдан", "Макс", "Рома", "Петя", "Артем", "Игорь", "Женя", "Толя", "Павел",
    "Тарас", "Вася", "Гриша", "Олексей", "Леонид", "Сеня", "Толя", "Слава", "Кирилл", "Ростик",
    "Валерий", "Данил", "Леша", "Альберт", "Марк", "Боря", "Георгий", "Денис", "Святослав", "Ярослав",
    "Степан", "Валентин", "Мирослав", "Адам", "Жора", "Илья", "Матвей", "Юра", "Богдан", "Валерий",
    "Давид", "Артур", "Остап", "Изя", "Семен", "Никита", "Лев", "Витя", "Данила", "Дима",
    "Глеб", "Люба", "Руслан", "Тимур", "Герман", "Богдан", "Аркадий", "Мирон", "Володя", "Эд",
     "Родион", "Ераст", "Яков", "Евгений", "Эрнест"
  ],
  names_en: [
    "Alexander", "Andrey", "Dmitry", "Sergey", "Vladimir", "Oleg", "Ivan", "Yuri", "Nikolai", "Mikhail",
    "Vitaliy", "Bogdan", "Maxim", "Roman", "Peter", "Artem", "Igor", "Evgeniy", "Anton", "Pavel",
    "Taras", "Vasily", "Grigory", "Alexey", "Leonid", "Arseniy", "Anatoly", "Vadim", "Kirill", "Rostislav",
    "Valery", "Daniil", "Leon", "Albert", "Mark", "Boris", "Georgy", "Denis", "Vitaliy", "Svyatoslav",
    "Yaroslav", "Stepan", "Valentin", "Miroslav", "Adam", "Egor", "Ilya", "Matvey", "Julian", "Borislav",
    "Zahar", "Timofey", "Fedor", "Yan", "David", "Elisei", "Arthur", "Ostap", "Iziaslav", "Semyon",
    "Nikita", "Lev", "Victor", "Daniil", "Damir", "Gleb", "Lyubomir", "Ruslan", "Timur", "German",
    "Bogdan", "Arkady", "Miron", "Valentin", "Radomir", "Lukyan", "Titus", "Vladislav", "Eduard", "Ostap",
    "Rodion", "Danil", "Erast", "Savva", "Trofim", "Akim", "Justin", "Vasily", "Silantiy", "Nazar",
    "Evgeniy", "Valentin", "Vladimir", "Ernest", "Alexander"
  ],
  diminutive_names_en: [
    "Ollie", "Andy", "Dima", "Serge", "Vova", "Oleg", "Ivan", "Yura", "Kolya", "Misha",
    "Vitya", "Bogdan", "Max", "Roman", "Petya", "Arty", "Igor", "Genya", "Tony", "Pasha",
    "Taras", "Vasya", "Grisha", "Alex", "Leonid", "Senya", "Tony", "Slava", "Kyrill", "Rostik",
    "Val", "Dan", "Lesha", "Al", "Mark", "Borya", "George", "Denis", "Slavik", "Yaroslav",
    "Steve", "Valentin", "Miro", "Adam", "Yegor", "Ilyusha", "Matt", "Julik", "Borya", "Valera",
    "Dave", "Art", "Ostik", "Izya", "Semen", "Kolya", "Lev", "Vit", "Dan", "Dima",
    "Gleb", "Lyosha", "Russ", "Tim", "Herm", "Bogdan", "Ark", "Myron", "Vlad", "Ed",
    "Ad", "Zin", "Rodya", "Erast", "Opanas", "Kuz", "Plat", "Sav", "Troy", "Yak",
    "Justin", "Sil", "Naz", "Yev", "Ernie"
  ]
}

FEMALE_PATRNYMICS = {
  patronymics_ua: [
    "Олександрівна", "Андріївна", "Дмитрівна", "Сергіївна", "Володимирівна", "Олегівна", "Іванівна", "Юріївна", "Миколаївна", "Михайлівна",
    "Віталіївна", "Богданівна", "Максимівна", "Романівна", "Петрівна", "Артемівна", "Ігорівна", "Євгенівна", "Антонівна", "Павлівна",
    "Тарасівна", "Василівна", "Григорівна", "Олексіївна", "Леонідівна", "Арсеніївна", "Анатоліївна", "Вадимівна", "Кирилівна", "Ростиславівна",
    "Валеріївна", "Данилівна", "Леонівна", "Альбертівна", "Марківна", "Борисівна", "Георгіївна", "Денисівна", "Святославівна",
    "Ярославівна", "Степанівна", "Валентинівна", "Мирославівна", "Адамівна", "Єгорівна", "Іллівна", "Матвіївна", "Юліанівна", "Бориславівна",
    "Захарівна", "Тимофіївна", "Федорівна", "Янівна", "Давидівна", "Єлисєївна", "Артурівна", "Остапівна", "Ізяславівна", "Семенівна",
    "Микитівна", "Львівна", "Вікторівна", "Даниїлівна", "Дамірівна", "Глібівна", "Любомирівна", "Русланівна", "Тимурівна", "Германівна",
    "Богданівна", "Аркадіївна", "Миронівна", "Володиславівна", "Едуардівна", "Адріанівна", "Зиновіївна", "Родіонівна",  "Назарівна", "Євгеніївна"
  ],
  patronymics_ru: [
    "Александровна", "Андреевна", "Дмитриевна", "Сергеевна", "Владимировна", "Олеговна", "Ивановна", "Юрьевна", "Николаевна", "Михайловна",
    "Витальевна", "Богдановна", "Максимовна", "Романовна", "Петровна", "Артемовна", "Игоревна", "Евгеньевна", "Антоновна", "Павловна",
    "Тарасовна", "Васильевна", "Григорьевна", "Алексеевна", "Леонидовна", "Арсеньевна", "Анатольевна", "Вадимовна", "Кирилловна", "Ростиславовна",
    "Валерьевна", "Даниловна", "Леоновна", "Альбертовна", "Марковна", "Борисовна", "Георгиевна", "Денисовна", "Святославовна",
    "Ярославовна", "Степановна", "Валентиновна", "Мирославовна", "Адамовна", "Егоровна", "Ильинична", "Матвеевна", "Юлиановна", "Бориславовна",
    "Захаровна", "Тимофеевна", "Федоровна", "Яновна", "Давидовна", "Елисеевна", "Артуровна", "Остаповна", "Изяславовна", "Семёновна",
    "Никитовна", "Львовна", "Викторовна", "Данииловна", "Дамировна", "Глебовна", "Любомировна", "Руслановна", "Тимуровна", "Германовна",
    "Богдановна", "Аркадьевна", "Мироновна", "Владиславовна", "Эдуардовна" "Евгеньевна", "Эрнестовна"
  ]

}

MALE_PATRNYMICS = {
  patronymics_ua: [
    "Олександрович", "Андрійович", "Дмитрович", "Сергійович", "Володимирович", "Олегович", "Іванович", "Юрійович", "Миколайович", "Михайлович",
    "Віталійович", "Богданович", "Максимович", "Романович", "Петрович", "Артемович", "Ігорович", "Євгенович", "Антонович", "Павлович",
    "Тарасович", "Васильович", "Григорович", "Олексійович", "Леонідович", "Арсенійович", "Анатолійович", "Вадимович", "Кирилович", "Ростиславович",
    "Валерійович", "Данилович", "Леонович", "Альбертович", "Маркович", "Борисович", "Георгійович", "Денисович", "Святославович",
    "Ярославович", "Степанович", "Валентинович", "Мирославович", "Адамович", "Єгорович", "Ілліч", "Матвійович", "Юліанович", "Бориславович",
    "Захарович", "Тимофійович", "Федорович", "Янович", "Давидович", "Єлисеєвич", "Артурович", "Остапович", "Ізяславович", "Семенович",
    "Микитович", "Львович", "Вікторович", "Даниїлович", "Дамирович", "Глібович", "Любомирович", "Русланович", "Тимурович",
    "Богданович", "Аркадійович", "Миронович", "Володиславович", "Едуардович"
  ],
  patronymics_ru: [
    "Александрович", "Андреевич", "Дмитриевич", "Сергеевич", "Владимирович", "Олегович", "Иванович", "Юрьевич", "Николаевич", "Михайлович",
    "Витальевич", "Богданович", "Максимович", "Романович", "Петрович", "Артемович", "Игоревич", "Евгеньевич", "Антонович", "Павлович",
    "Тарасович", "Васильевич", "Григорьевич", "Алексеевич", "Леонидович", "Арсеньевич", "Анатольевич", "Вадимович", "Кириллович", "Ростиславович",
    "Валерьевич", "Данилович", "Леонович", "Альбертович", "Маркович", "Борисович", "Георгиевич", "Денисович", "Святославович",
    "Ярославович", "Степанович", "Валентинович", "Мирославович", "Адамович", "Егорович", "Ильич", "Матвеевич", "Юлианович", "Бориславович",
    "Захарович", "Тимофеевич", "Федорович", "Янович", "Давидович", "Елисеевич", "Артурович", "Остапович", "Изяславович", "Семёнович",
    "Никитович", "Львович", "Викторович", "Даниилович", "Дамирович", "Глебович", "Любомирович", "Русланович", "Тимурович",
    "Богданович", "Аркадьевич", "Миронович", "Владиславович", "Эдуардович",  "Евгеньевич", "Эрнестович"
  ]

}


