# числовые ключи у хешей используются для определения вероятности замены.
# в rand(1..100) % key == 0 будет верно, когда rand(1..100) возвращает число, которое делится на key без остатка.
# Если key равен 1, любое число от 1 до 10 будет делиться на 1 без остатка, поэтому проверка rand(1..10) % 1 == 0 будет истинной всегда.

HASH_DELETE_TEXT_RU = {
  1 => [
    /\bМария\b/i,
    /летней эксплуатации/i,
    /, кто ценит комфорт и безопасность!/,
    /(Братцы|Друзья|Дорогие друзья|Мужики|Блин|парниша|ребята)(\s*|)(,|!|)/i,
    /(мой|)(Нейтральный|Позитивный|Негативный|Положительный|Отрицательный) отзыв/i,
    /(Ого(в|)|Ой|Эй|Эх)(\s*|)(,|!|)/i
  ],
  4 => [
    /\bэт(о|и)\b/i,
    /на любо(й|м) (покрытии|трассе|поверхности|дороге)/i
  ]

}

HASH_DELETE_TEXT_UA = {
  1 => [
    /\bМарія\b/i,
    /літньої експлуатації/i,
    /, хто цінує комфорт та безпеку!/,
    /(Братці|Друзі|Дорогі друзі|Чоловіки|Млинець|хлопче|хлопці)(\s*|)(,|!|)/i,
    /(мій|)(Нейтральний|Позитивний|Негативний|Позитивний|Негативний) відгук/i,
    /(Ого(в|)|Ой|Гей|Ех)(\s*|)(,|!|)/i
  ],
  4 => [
    /\bце|ці\b/i,
    /на будь-як(ому|ій) (покритті|трасі|поверхні|дорозі)/i
  ]
}

HASH_REPLACE_TEXT_RU = {

}
HASH_REPLACE_TEXT_UA = {
  "галасливі" => "шумні",
  "галасливість" => "шумність"
}