# app/services/dictionaries/const_reviews_gender_female.rb

FEMALE_NAMES = {
  names_ua: [
    "Анна", "Анастасія", "Вікторія", "Ольга", "Марія", "Катерина", "Наталія", "Юлія", "Дарина", "Ірина",
    "Єлизавета", "Тетяна", "Софія", "Аліна", "Ксенія", "Марина", "Людмила", "Вероніка", "Олена", "Аліса",
    "Злата", "Ева", "Марта", "Ярослава", "Сніжана", "Світлана", "Дарія", "Поліна", "Ліза",
    "Мілана", "Ілона", "Валерія", "Діана", "Богдана", "Соломія", "Аміна", "Мирослава", "Роксолана", "Надія",
    "Зоряна", "Аліна", "Валентина", "Софія", "Юстина", "Влада", "Іванна", "Олександра", "Ганна",
    "Лідія", "Уляна", "Таїсія", "Оксана", "Яна", "Майя", "Каріна", "Маргарита", "Леся", "Еліна",
    "Аделіна", "Інна", "Орися", "Альона", "Віра", "Ніка", "Олеся", "Лілія", "Василина", "Галина",
    "Антоніна", "Мирослава", "Ірина", "Віталія", "Сабіна", "Любов", "Емілія", "Кіра", "Аріна", "Стефанія",
    "Наталя", "Дар'я", "Олександра", "Агата", "Ізабелла", "Агнія", "Клавдія", "Серафима", "Влада",
    "Аліса", "Нонна", "Зоя", "Лариса", "Фаїна", "Валерія", "Юлія", "Меланія"
  ],
  diminutive_names_ua: [
    "Аня", "Настя", "Віка", "Оля", "Маша", "Катя", "Наташа", "Юля", "Даша", "Іра",
    "Ліза", "Таня", "Софійка", "Аліна", "Ксюша", "Маринка", "Люда", "Віка", "Лєна", "Аліса",
    "Злата", "Єва", "Марта", "Яся", "Сніжана", "Свєта", "Даша", "Поліна", "Емма", "Ліза",
    "Міла", "Ілона", "Лєра", "Діана", "Богданка", "Соля", "Аміна", "Міра", "Рокса", "Надя",
    "Зоряна", "Алінка", "Валя", "Соня", "Юстина", "Влада", "Іванка", "Саша", "Анечка",
    "Ліда", "Уляна", "Тася", "Оксана", "Яна", "Майя", "Каріна", "Рита", "Леся", "Еля",
    "Аделіна", "Інна", "Орися", "Альона", "Віра", "Ніка", "Олеся", "Ліля", "Вася", "Галя",
    "Тоня", "Мирослава", "Ірина", "Віталія", "Сабіна", "Любов", "Емма", "Кіра", "Арина",
    "Наташа", "Даша", "Саша", "Агата", "Іза", "Агнія", "Клава", "Серафима", "Влада",
    "Аміна", "Аліса", "Нонна", "Зоя", "Лариса", "Фая", "Люція", "Лєра", "Юля", "Меланія"
  ],
  names_ru: [
    "Анна", "Анастасия", "Виктория", "Ольга", "Мария", "Екатерина", "Наталья", "Юлия", "Дарья", "Ирина",
    "Елизавета", "Татьяна", "София", "Алина", "Ксения", "Марина", "Людмила", "Вероника", "Елена", "Алиса",
    "Злата", "Ева", "Марта", "Ярослава", "Снежана", "Светлана", "Дария", "Полина", "Эмилия", "Лиза",
    "Милана", "Илона", "Валерия", "Диана", "Богдана", "Мирослава", "Роксолана", "Надежда",
    "Зоряна", "Алина", "Валентина", "София", "Юстина", "Влада", "Иванна", "Александра",
    "Лидия", "Ульяна", "Таисия", "Оксана", "Яна", "Майя", "Карина", "Маргарита", "Леся", "Элина",
    "Аделина", "Инна", "Орыся", "Алена", "Вера", "Ника", "Олеся", "Лилия", "Василина", "Галина",
    "Антонина", "Мирослава", "Ирина", "Виталия", "Сабина", "Любовь", "Эмилия", "Кира", "Арина", "Стефания",
    "Наталья", "Дарья", "Александра", "Агата", "Изабелла", "Агния", "Клавдия", "Серафима", "Влада", "Адель",
    "Амина", "Алиса", "Нонна", "Зоя", "Лариса", "Фаина", "Люция", "Валерия", "Юлия", "Мелания"
  ],
  diminutive_names_ru: [
    "Аня", "Настя", "Вика", "Оля", "Маша", "Катя", "Наташа", "Юля", "Даша", "Ира",
    "Лиза", "Таня", "София", "Алина", "Ксюша", "Марина", "Люда", "Вероника", "Лена", "Алиса",
    "Злата", "Ева", "Марта", "Яся", "Снежана", "Света", "Даша", "Поля", "Эмма", "Лиза",
    "Мила", "Илона", "Лера", "Диана", "Богдана", "Соля", "Амина", "Мира", "Рокси", "Надя",
    "Зоряна", "Алинка", "Валя", "Соня", "Юстина", "Влада", "Иванна", "Саша", "Анечка", "Регина",
    "Лида", "Уля", "Тася", "Оксана", "Яна", "Майя", "Карина", "Рита", "Леся", "Эля",
    "Аделина", "Инна", "Орыся", "Алена", "Вера", "Ника", "Олеся", "Лиля", "Вася", "Галя",
    "Тоня", "Мирослава", "Ирина", "Виталия", "Сабина", "Люба", "Эмма", "Кира", "Арина", "Стефа",
    "Наташа", "Даша", "Саша", "Агата", "Иза", "Агния", "Клава", "Серафима", "Влада", "Адель",
    "Амина", "Алиса", "Нонна", "Зоя", "Лариса", "Фая", "Люция", "Лера", "Юля", "Мелания"
  ],

  names_en: [
    "Anna", "Anastasia", "Victoria", "Olga", "Maria", "Ekaterina", "Natalia", "Julia", "Daria", "Irina",
    "Elizabeth", "Tatiana", "Sophia", "Alina", "Ksenia", "Marina", "Lyudmila", "Veronika", "Elena", "Alice",
    "Zlata", "Eva", "Marta", "Yaroslava", "Snezhana", "Svetlana", "Dariya", "Polina", "Emilia", "Liza",
    "Milana", "Ilona", "Valeria", "Diana", "Bogdana", "Solomiya", "Amina", "Miroslava", "Roksolana", "Nadezhda",
    "Zoryana", "Alina", "Valentina", "Sophia", "Justina", "Vlada", "Ivanna", "Alexandra", "Anna", "Regina",
    "Lidia", "Ulyana", "Taisia", "Oksana", "Yana", "Maya", "Karina", "Margarita", "Lesya", "Elina",
    "Adelina", "Inna", "Orysya", "Alena", "Vera", "Nika", "Olesya", "Lilia", "Vasylina", "Galina",
    "Antonina", "Miroslava", "Irina", "Vitalia", "Sabina", "Lyubov", "Emilia", "Kira", "Arina", "Stefania",
    "Natalia", "Darya", "Alexandra", "Agata", "Isabella", "Agnia", "Klavdia", "Serafima", "Vlada", "Adel",
    "Amina", "Alice", "Nonna", "Zoya", "Larisa", "Faina", "Lyutsia", "Valeria", "Julia", "Melania"
  ],
  diminutive_names_en: [
    "Anna", "Nastya", "Vika", "Olya", "Masha", "Katya", "Natasha", "Julia", "Dasha", "Ira",
    "Lisa", "Tanya", "Sophie", "Alina", "Ksyusha", "Marina", "Lyuda", "Veronica", "Lena", "Alice",
    "Zlata", "Eva", "Martha", "Yasya", "Snizhana", "Sveta", "Dasha", "Polly", "Emma", "Lisa",
    "Mila", "Ilona", "Lera", "Diana", "Bogdana", "Solya", "Amina", "Mira", "Roxie", "Nadia",
    "Zoriana", "Alinka", "Valya", "Sonya", "Justine", "Vlada", "Ivanna", "Sasha", "Annie", "Regina",
    "Lydia", "Ully", "Tasya", "Oksana", "Yana", "Maya", "Karina", "Rita", "Lesya", "Ella",
    "Adelina", "Inna", "Orisia", "Alena", "Vera", "Nika", "Olesya", "Lily", "Vasya", "Galya",
    "Tonya", "Miroslava", "Irina", "Vitaliya", "Sabina", "Lyubov", "Emma", "Kira", "Arina", "Steffa",
    "Natasha", "Dasha", "Sasha", "Agatha", "Iza", "Agnia", "Klava", "Seraphima", "Vlada", "Adel",
    "Amina", "Alice", "Nonna", "Zoya", "Larisa", "Faya", "Lucia", "Lera", "Yulia", "Melania"
  ]

}

FEMALE_PATRNYMICS = {
  patronymics_ua: [
    "Олександрівна", "Андріївна", "Дмитрівна", "Сергіївна", "Володимирівна", "Олегівна", "Іванівна", "Юріївна", "Миколаївна", "Михайлівна",
    "Віталіївна", "Богданівна", "Максимівна", "Романівна", "Петрівна", "Артемівна", "Ігорівна", "Євгенівна", "Антонівна", "Павлівна",
    "Тарасівна", "Василівна", "Григорівна", "Олексіївна", "Леонідівна", "Арсеніївна", "Анатоліївна", "Вадимівна", "Кирилівна", "Ростиславівна",
    "Валеріївна", "Данилівна", "Леонівна", "Альбертівна", "Марківна", "Борисівна", "Георгіївна", "Денисівна", "Святославівна",
    "Ярославівна", "Степанівна", "Валентинівна", "Мирославівна", "Адамівна", "Єгорівна", "Іллівна", "Матвіївна", "Юліанівна", "Бориславівна",
    "Захарівна", "Тимофіївна", "Федорівна", "Янівна", "Давидівна", "Єлисєївна", "Артурівна", "Остапівна", "Ізяславівна", "Семенівна",
    "Микитівна", "Львівна", "Вікторівна", "Даниїлівна", "Дамірівна", "Глібівна", "Любомирівна", "Русланівна", "Тимурівна", "Германівна",
    "Богданівна", "Аркадіївна", "Миронівна", "Володиславівна", "Едуардівна", "Адріанівна",  "Родіонівна", "Назарівна", "Євгеніївна"
  ],
  patronymics_ru: [
    "Александровна", "Андреевна", "Дмитриевна", "Сергеевна", "Владимировна", "Олеговна", "Ивановна", "Юрьевна", "Николаевна", "Михайловна",
    "Витальевна", "Богдановна", "Максимовна", "Романовна", "Петровна", "Артемовна", "Игоревна", "Евгеньевна", "Антоновна", "Павловна",
    "Тарасовна", "Васильевна", "Григорьевна", "Алексеевна", "Леонидовна", "Арсеньевна", "Анатольевна", "Вадимовна", "Кирилловна", "Ростиславовна",
    "Валерьевна", "Даниловна", "Леоновна", "Альбертовна", "Марковна", "Борисовна", "Георгиевна", "Денисовна", "Святославовна",
    "Ярославовна", "Степановна", "Валентиновна", "Мирославовна", "Адамовна", "Егоровна", "Ильинична", "Матвеевна", "Юлиановна", "Бориславовна",
    "Захаровна", "Тимофеевна", "Федоровна", "Яновна", "Давидовна", "Елисеевна", "Артуровна", "Остаповна", "Изяславовна", "Семёновна",
    "Никитовна", "Львовна", "Викторовна", "Данииловна", "Дамировна", "Глебовна", "Любомировна", "Руслановна", "Тимуровна", "Германовна",
    "Богдановна", "Аркадьевна", "Мироновна", "Владиславовна", "Эдуардовна", "Евгеньевна", "Эрнестовна"
  ]

}


