# app/services/dictionaries/const_reviews_gender_male.rb

MALE_NAMES = {
  names_ua: [
    "Олександр", "Андрій", "Дмитро", "Сергій", "Володимир", "Олег", "Іван", "Юрій", "Микола", "Михайло",
    "Віталій", "Богдан", "Максим", "Роман", "Петро", "Артем", "Ігор", "Євген", "Антон", "Павло",
    "Тарас", "Василь", "Григорій", "Олексій", "Леонід", "Арсеній", "Анатолій", "Вадим", "Кирило", "Ростислав",
    "Валерій", "Данило", "Леон", "Альберт", "Марко", "Борис", "Георгій", "Денис", "Віталій", "Святослав",
    "Ярослав", "Степан", "Валентин", "Мирослав", "Адам", "Єгор", "Ілля", "Матвій", "Юліан",
    "Захар", "Тимофій", "Федір", "Ян", "Давид", "Артур", "Остап", "Семен",
    "Микита", "Лев", "Віктор", "Даниїл", "Дамір", "Гліб", "Любомир", "Руслан", "Тимур",
    "Богдан", "Аркадій", "Мирон", "Валентин", "Володислав", "Едуард", "Остап",
    "Адріан", "Зиновій", "Родіон", "Данило", "Ераст",
    "Яким", "Василь", "Назар", "Євгеній", "Валентин", "Володимир", "Ернест", "Олександр"
  ],
  diminutive_names_ua: [
    "Олесь", "Вова", "Олег", "Коля", "Миша",
    "Вітя", "Богдан", "Макс", "Роман", "Петро", "Артем", "Ігор", "Женя", "Тоня", "Павло",
    "Тарас", "Василь", "Гриша", "Олексій", "Леонід", "Сеня", "Толя", "Славік", "Кіріл", "Ростик",
    "Валерій", "Данило", "Лєша", "Альберт", "Марк", "Борис", "Георгій", "Денис", "Святослав", "Ярік",
    "Степан", "Валентин", "Слава", "Адам", "Єгор", "Ілля", "Матвій", "Богдан", "Валера",
    "Давид", "Артур", "Остап", "Семен", "Микита", "Лев", "Вітя", "Даня", "Діма",
    "Гліб", "Руслан", "Тимур", "Герман", "Бодя", "Аркадій", "Мирон", "Володя", "Ед",
    "Адріан", "Зіновій", "Родіон", "Ераст", "Опанас", "Яків",
    "Назар", "Євгеній", "Ернест"
  ],
  names_ru: [
    "Александр", "Андрей", "Дмитрий", "Сергей", "Владимир", "Олег", "Иван", "Юрий", "Николай", "Михаил",
    "Виталий", "Богдан", "Максим", "Роман", "Петр", "Артем", "Игорь", "Евгений", "Антон", "Павел",
    "Тарас", "Василий", "Григорий", "Алексей", "Леонид", "Арсений", "Анатолий", "Вадим", "Кирилл", "Ростислав",
    "Валерий", "Даниил", "Леон", "Марк", "Борис", "Георгий", "Денис", "Виталий", "Святослав",
    "Ярослав", "Степан", "Валентин", "Мирослав", "Адам", "Егор", "Илья", "Матвей", "Юлиан", "Борислав",
    "Тимофей", "Федор", "Ян", "Давид", "Елисей", "Артур", "Остап", "Семен",
    "Никита", "Лев", "Виктор", "Даниил", "Дамир", "Глеб", "Любомир", "Руслан", "Тимур",
    "Богдан", "Аркадий", "Мирон", "Валентин", "Владислав", "Эдуард",
    "Родион", "Данил", "Эраст", "Василий", "Евгений", "Владимир", "Эрнест", "Александр"
  ],
  diminutive_names_ru: [
    "Олег", "Андрюша", "Дима", "Сергей", "Вова", "Олег", "Иван", "Юра", "Коля", "Миша",
    "Витя", "Богдан", "Макс", "Рома", "Петя", "Артем", "Игорь", "Женя", "Толя", "Павел",
    "Тарас", "Вася", "Гриша", "Олексей", "Леонид", "Сеня", "Толя", "Слава", "Кирилл", "Ростик",
    "Валерий", "Данил", "Леша", "Альберт", "Марк", "Боря", "Георгий", "Денис", "Святослав", "Ярослав",
    "Степан", "Валентин", "Мирослав", "Адам", "Жора", "Илья", "Матвей", "Юра", "Богдан", "Валерий",
    "Давид", "Артур", "Остап", "Изя", "Семен", "Никита", "Лев", "Витя", "Данила", "Дима",
    "Глеб", "Люба", "Руслан", "Тимур", "Герман", "Богдан", "Аркадий", "Мирон", "Володя", "Эд",
    "Родион", "Ераст", "Яков", "Евгений", "Эрнест"
  ],
  names_en: [
    "Alexander", "Andrey", "Dmitry", "Sergey", "Vladimir", "Oleg", "Ivan", "Yuri", "Nikolai", "Mikhail",
    "Vitaliy", "Bogdan", "Maxim", "Roman", "Peter", "Artem", "Igor", "Evgeniy", "Anton", "Pavel",
    "Taras", "Vasily", "Grigory", "Alexey", "Leonid", "Arseniy", "Anatoly", "Vadim", "Kirill", "Rostislav",
    "Valery", "Daniil", "Leon", "Albert", "Mark", "Boris", "Georgy", "Denis", "Vitaliy", "Svyatoslav",
    "Yaroslav", "Stepan", "Valentin", "Miroslav", "Adam", "Egor", "Ilya", "Matvey", "Julian", "Borislav",
    "Zahar", "Timofey", "Fedor", "Yan", "David", "Elisei", "Arthur", "Ostap", "Iziaslav", "Semyon",
    "Nikita", "Lev", "Victor", "Daniil", "Damir", "Gleb", "Lyubomir", "Ruslan", "Timur", "German",
    "Bogdan", "Arkady", "Miron", "Valentin", "Radomir", "Lukyan", "Titus", "Vladislav", "Eduard", "Ostap",
    "Rodion", "Danil", "Erast", "Savva", "Trofim", "Akim", "Justin", "Vasily", "Silantiy", "Nazar",
    "Evgeniy", "Valentin", "Vladimir", "Ernest", "Alexander"
  ],
  diminutive_names_en: [
    "Ollie", "Andy", "Dima", "Serge", "Vova", "Oleg", "Ivan", "Yura", "Kolya", "Misha",
    "Vitya", "Bogdan", "Max", "Roman", "Petya", "Arty", "Igor", "Genya", "Tony", "Pasha",
    "Taras", "Vasya", "Grisha", "Alex", "Leonid", "Senya", "Tony", "Slava", "Kyrill", "Rostik",
    "Val", "Dan", "Lesha", "Al", "Mark", "Borya", "George", "Denis", "Slavik", "Yaroslav",
    "Steve", "Valentin", "Miro", "Adam", "Yegor", "Ilyusha", "Matt", "Julik", "Borya", "Valera",
    "Dave", "Art", "Ostik", "Izya", "Semen", "Kolya", "Lev", "Vit", "Dan", "Dima",
    "Gleb", "Lyosha", "Russ", "Tim", "Herm", "Bogdan", "Ark", "Myron", "Vlad", "Ed",
    "Ad", "Zin", "Rodya", "Erast", "Kuz", "Plat", "Sav", "Troy", "Yak",
    "Justin", "Sil", "Naz", "Yev", "Ernie"
  ]
}

MALE_PATRNYMICS = {
  patronymics_ua: [
    "Олександрович", "Андрійович", "Дмитрович", "Сергійович", "Володимирович", "Олегович", "Іванович", "Юрійович", "Миколайович", "Михайлович",
    "Віталійович", "Богданович", "Максимович", "Романович", "Петрович", "Артемович", "Ігорович", "Євгенович", "Антонович", "Павлович",
    "Тарасович", "Васильович", "Григорович", "Олексійович", "Леонідович", "Арсенійович", "Анатолійович", "Вадимович", "Кирилович", "Ростиславович",
    "Валерійович", "Данилович", "Леонович", "Альбертович", "Маркович", "Борисович", "Георгійович", "Денисович", "Святославович",
    "Ярославович", "Степанович", "Валентинович", "Мирославович", "Адамович", "Єгорович", "Ілліч", "Матвійович", "Юліанович", "Бориславович",
    "Захарович", "Тимофійович", "Федорович", "Янович", "Давидович", "Єлисеєвич", "Артурович", "Остапович", "Ізяславович", "Семенович",
    "Микитович", "Львович", "Вікторович", "Даниїлович", "Дамирович", "Глібович", "Любомирович", "Русланович", "Тимурович",
    "Богданович", "Аркадійович", "Миронович", "Володиславович", "Едуардович"
  ],
  patronymics_ru: [
    "Александрович", "Андреевич", "Дмитриевич", "Сергеевич", "Владимирович", "Олегович", "Иванович", "Юрьевич", "Николаевич", "Михайлович",
    "Витальевич", "Богданович", "Максимович", "Романович", "Петрович", "Артемович", "Игоревич", "Евгеньевич", "Антонович", "Павлович",
    "Тарасович", "Васильевич", "Григорьевич", "Алексеевич", "Леонидович", "Арсеньевич", "Анатольевич", "Вадимович", "Кириллович", "Ростиславович",
    "Валерьевич", "Данилович", "Леонович", "Альбертович", "Маркович", "Борисович", "Георгиевич", "Денисович", "Святославович",
    "Ярославович", "Степанович", "Валентинович", "Мирославович", "Адамович", "Егорович", "Ильич", "Матвеевич", "Юлианович", "Бориславович",
    "Захарович", "Тимофеевич", "Федорович", "Янович", "Давидович", "Елисеевич", "Артурович", "Остапович", "Изяславович", "Семёнович",
    "Никитович", "Львович", "Викторович", "Даниилович", "Дамирович", "Глебович", "Любомирович", "Русланович", "Тимурович",
    "Богданович", "Аркадьевич", "Миронович", "Владиславович", "Эдуардович", "Евгеньевич", "Эрнестович"
  ]

}
